{"user_input":{"0":"How many Executive Officers are there in the company as at 24 February 2020?","1":"When did the company adopt ASC 606?","2":"Which years does the table show?"},"retrieved_contexts":{"0":["## PART III\n\n## Item 10.Directors, Executive Officers and Corporate Governance\n\nThe information required by Item 401, Item 405, Item 406 and Item 407 (c)(3), (d)(4) and (d)(5) of Regulation S-K regarding directors of Cincinnati Bell Inc. can be found in the Proxy Statement for the 2020 Annual Meeting of Shareholders and is incorporated herein by reference.\n\nThe Company's Code of Ethics for Senior Financial Officers that applies to its Chief Executive Officer, Chief Financial Officer and Chief Accounting Officer is posted on the Company's website at http:\/\/www.cincinnatibell.com.Within the time period required by the SEC and the New York Stock Exchange (\"NYSE\"), the Company will post on its website any amendment to the Code of Ethics for Senior Financial Officers and any waiver of such code relating to such senior executive officers of the Company.\n\nIn addition to the certifications of the Company's Chief Executive Officer and Chief Financial Officer required under Section 302 of the Sarbanes-Oxley Act of 2002 and filed as exhibits to this Annual Report on Form 10-K, in May 2019, the Company's Chief Executive Officer submitted to the NYSE the certification regarding compliance with the NYSE's corporate governance listing standards required by Section 303 A.12 of the NYSE Listed Company Manual.\n\n## Executive Officers of the Registrant:\n\nThe names, ages and positions of the executive officers of the Company as of February 24, 2020 are as follows:\n\nTable of Contents\n\n| Name                  |   Age |Title                                                                | |-----------------------|-------|----------------------------------------------------------------------| | Leigh R Fox           |    47 | President and Chief Executive Officer                                | | Andrew R Kaiser       |    51 | Chief Financial Officer                                              | | Christi H. Cornette   |    64 | Chief Culture Officer                                                | | Thomas E. Simpson     |    47 | Chief Operating Officer                                              | | Christopher J. Wilson |    54 | Vice President and General Counsel                                   | | Joshua T. Duckworth   |    41 | Vice President of Treasury, Corporate Finance and Investor Relations | | Suzanne E. Maratta    |    37 | Vice President and Corporate Controller                              |\n\nOfficers are elected annually but are removable at the discretion of the Board of Directors.\n\nLEIGH R. FOX, President and Chief Executive Officer since May 31, 2017; President and Chief Operating Officer of the Company from September 2016 to May 2017; Chief Financial Officer of the Company from October 2013 to September 2016; Chief Administrative Officer of the Company from July 2013 to October 2013; Senior Vice President of Finance and Operations from December 2012 to July 2013; Vice President of Finance at Cincinnati Bell Technology Solutions Inc. (CBTS) from October 2008 to December 2012.\n\nANDREW R. KAISER, Chief Financial Officer of the Company since September 2016; Vice President, Consumer Marketing and Data Analytics of the Company from December 2015 to September 2016; Vice President, Corporate Finance of the Company from January 2014 to December 2015; Partner at Howard Roark Consulting, LLC from 2005 to January 2014.\n\nCHRISTI H. CORNETTE, Chief Culture Officer of the Company since June 2017; Senior Vice President, Marketing of the Company from August 2013 to June 2017; Vice President, Marketing of the Company from October 2008 to August 2013; Director of CBTS Marketing from October 2002 to October 2008.\n\nTHOMAS E. SIMPSON, Chief Operating Officer since June 2017, Senior Vice President and Chief Technology Officer of the Company from January 2015 to June 2017; Vice President and Chief Technology Officer at Cincinnati Bell Technology Solutions (CBTS) from 2014 to 2015; Vice President, Research and Development at CBTS from 2010 to 2014; Director, Technical Operations at CBTS from 2008 to 2010.\n\nCHRISTOPHER J. WILSON, Vice President and General Counsel of the Company since August 2003.\n\nJOSHUA T. DUCKWORTH, Vice President of Treasury, Corporate Finance and Inventor Relations since October 2017; Vice President, Investor Relations and Controller of the Company from July 2013 to October 2017; Assistant Treasurer and Director of Investor Relations for Cincinnati Bell Inc. from August 2012 to July 2013; Assistant Controller for Cincinnati Bell Inc. from August 2010 to August 2012; Deloitte & Touche LLP's audit practice from October 2004 to August 2010.\n\nSUZANNE E MARATTA, Vice President and Corporate Controller of the Company since May 2019; Assistant Corporate Controller of the Company from August 2017 to May 2019; Senior Financial Reporting Manager of the Company from May 2014 to August 2017; Auditor at PricewaterhouseCoopers from January 2007 to May 2014.","## ITEM NO. 2 - RATIFICATION OF KPMG A SOUR 2020 INDEPENDENT AUDITOR\n\n<!-\n\nimage -\n\n>\n\n## THE BOARD UNANIMOUSLY RECOMMENDS A VOTE FOR THIS PROPOSAL\n\nThe A u dit Committee of the Board has appointed KPMG LLP as o u r independent a u ditor for the fiscal y ear ending December 31, 2020, and we are s u bmitting that appointment to o u r shareholders for ratification on an advisor y basis at the meeting.Altho u gh shareholder ratification of KPMG's appointment is not legall y req u ired, we are s u bmitting this matter to the shareholders, as in the past, as a matter of good corporate practice.In determining whether to reappoint KPMG as o u r independent a u ditor, the A u dit Committee considered a n u mber of factors, incl u ding, among others, the firm's q u alifications, ind u str y expertise, prior performance, control proced u res, proposed staffing and the reasonableness of its fees on an absol u te basis and as compared with fees paid b y comparable companies.\n\nIf the shareholders fail to vote on an advisor y basis in favor of the appointment, the A u dit Committee will reconsider whether to retain KPMG, and ma y appoint that firm or another witho u tres u bmitting the matter to the shareholders.Even if the shareholders ratif y the appointment, the A u dit Committee ma y , in its discretion, select a different independent a u ditor at an y time du ring the y ear if it determines that s u ch a change wo u ld be in the Compan y 's best interests.\n\nIn connection with the a u dit of the 2019 financial statements, we entered into an engagement letter with KPMG which sets forth the terms b y which KPMG will provide a u dit services to u s.An y f u t u re disp u tes between KPMG and u s u nder that letter will be s u bject to certain specified alternative disp ute resol u tion proced u res, none of which are intended to restrict the remedies that o u r shareholders might independentl y p u rs u e against KPMG.\n\nThe following table lists the aggregate fees and costs billed to u sb y KPMG and its affiliates for the 2018 and 2019 services identified below:\n\n|                          | Amount Billed   | Amount Billed   | |--------------------------|-----------------|-----------------| |                          | 2018            | 2019            | |A u dit Fees (1)         | $16,014,014     | $17,639,702     | | A u dit-Related Fees (2) | 106,528         | 153,203         | | Tax Fees (3)             | 1,318,798       | 119,098         | | Other                    | -               | -               | |Total Fees               | $17,439,340     | $17,912,003     |\n\nThe A u dit Committee maintains written proced u resthat requ ire it to ann u all y review and pre-approve the scope of all services to be performed b y o u r independent a u ditor.This review incl u des an eval u ation of whether the provision of non-a u dit services b y o u r independent a u ditor is compatible with maintaining the a u ditor's\n\n|\n\n<!-\n\nimage -\n\n>"],"1":["As a result of the adoption of ASC 606, our deferred product revenues and deferred product costs for the fleet management and auto vehicle finance verticals increased as balances are now amortized over the estimated average in-service lives of these devices.Deferred income tax assets and accumulated deficit increased as a result of the changes made to our deferred product revenues and deferred product costs.The cumulative effect of the changes made to our consolidated balance sheet for the adoption of ASC 606 were as follows (in thousands):\n\n|                                               | Balance at February 28, 2018   | ASC 606  Adjustments   | Balance at March 1, 2018   | |-----------------------------------------------|--------------------------------|------------------------|----------------------------|| Assets                                        |                                |                        |                            | | Prepaid expenses and other current assets (1) | $ 12,000                       | 1,891                  | $ 13,891                   | | Deferred income tax assets                    | 31,581                         | 532                    | 32,113                     | | Other assets (1)                              | 18,829\n\n| 3,145                  | 21,974                     | | Liabilities and Stockholders' Equity          |                                |                        |                            | |Deferred revenue                              | $ 17,757                       | 2,156                  | 19,913                     | | Other non-current liabilities                 | 24,249                         | 5,007                  | 29,256                     | | Stockholders' equity                          |                                |                        |                            | | Accumulated deficit                           | $ (19,459)                     | (1,595)                | (21,054)                   |\n\nIn accordance with the requirements of ASC 606, the disclosure of the impact of adoption on our consolidated balance sheet as of the fiscal year ended February 28, 2019 is as follows:\n\n|                                               | As of February 28, 2019   | As of February 28, 2019   | As of February 28, 2019   | |-----------------------------------------------|---------------------------|---------------------------|---------------------------| |                                               | As reported               | ASC 606  Adjustments      | Without ASC 606  Adoption || Assets                                        |                           |                           |                           | | Prepaid expenses and other current assets (1) | $ 19,373                  | (1,473)                   | $ 17,900                  | | Deferred income tax assets                    | 22,626                    | (532)                     | 22,094                    |\n\n| Other assets (1)                              | 22,510                    | (3,319)                   | 19,191                    | | Liabilities and Stockholders' Equity          |                           |                           |                           | | Deferred revenue (2)                          | $ 24,264                  | (1,945)                   | 22,319                    | | Other non-current liabilities (2)             | 38,476                    | (5,353)                   | 33,123                    | | Stockholders' equity:                         |                           |                           |                           | | Accumulated deficit                           | $ (2,227)                 | 1,689                     | (538)                     |\n\nThe impact of adopting ASC 606 on our consolidated statements of comprehensive income (loss) for the fiscal year ended February 28, 2019 was immaterial.","## NOTE 6\n\nCONTRACT ASSETS AND LIABILITIES\n\nContract assets include unbilled amounts typically resulting from sales under contracts when the percentage-ofcompletion cost-to-cost method of revenue recognition is utilized and revenue recognized exceeds the amount billed to the customer.Contract liabilities (formerly referred to as customer advances prior to the adoption of ASC 606) include advance payments and billings in excess of revenue recognized.Contract assets and contract liabilities were as follows (in thousands):\n\n|                      | September 30,  2019   | October 1,  2018   | |----------------------|-----------------------|--------------------|| Contract assets      | $   349,559           | $   272,210        | | Contract liabilities | $   46,170            | $   70,127         |\n\nContract assets increased $77.3 million during the twelve months ended September 30, 2019, due to the recognition of revenue related to the satisfaction or partial satisfaction of performance obligations during the twelve months ended September 30, 2019 for which we have not yet billed.There were no significant impairment losses related to our contract assets during the twelve months ended September 30, 2019.\n\nContract liabilities decreased $24.0 million during the twelve months ended September 30, 2019, due to revenue recognition in excess of payments received on these performance obligations.During the twelve-month period ended September 30, 2019, we recognized $62.4 million of our contract liabilities at October 1, 2018 as revenue.We expect our contract liabilities to be recognized as revenue over the next twelve months.\n\n## NOTE 7\n\nACCOUNTS RECEIVABLE\n\nThe components of accounts receivable are as follows (in thousands):\n\n|                                          | September 30,   | September 30,   | |------------------------------------------|-----------------|-----------------| |                                          | 2019            | 2018            | | Accounts receivable                      |                 |                 | | Billed                                   | $   127,406     | $ 156,948       | | Unbilled                                 | -               | 242,877         | | Allowance for doubtful accounts          | (1,392)         | (1,324)         | |Total accounts receivable                | 126,014         | 398,501         | |Less estimated amounts not currently due | -               | (6,134)         | |Current accounts receivable              | $  126,014      | $ 392,367       |\n\nAmounts billed include $60.3 million and $80.5 million due on U.S. federal government contracts at September 30, 2019 and 2018, respectively.As further described in Note 2, effective October 1, 2018, the co mponent of accounts receivable that consisted of unbilled contract receivables as reported under ASC 605 has been reclassified as contract assets under ASC 606.\n\nIn our normal course of business, we may sell trade receivables to financial institutions as a cash management technique.We do not retain financial or legal obligations for these receivables that would result in material losses.Our ongoing involvement is limited to the remittance of customer payments to the financial institutions with respect to the sold trade receivables; therefore, our sold trade receivables are not included in our Consolidated Balance Sheet in any period presented.As of September 30, 2019, we sold $31.1 million of outstanding trade receivables to financial institutions."],"2":["## Statements of Cash Flows\n\nThe following table summarizes our cash flow related activities (in thousands):\n\n|                                                                                                                    | Years Ended December 31,   | Years Ended December 31,   | Years Ended December 31,   | |--------------------------------------------------------------------------------------------------------------------|----------------------------|----------------------------|----------------------------| |                                                                                                                    | 2019                       | 2018                       | 2017                       | | Cash (used in) provided by:                                                                                        |                            |                            |                            | | Operating activities . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| $ (426)                    | $(2,694)                   | $14,314                    | | Investing activities .. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| (251)                      | (6,876)                    | (5,142)                    | | Financing activities . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 5,798                      | 3,624                      | 8,420                      | | Net increase (decrease) in cash and cash equivalents ..\n\n. . . . . . . . . . . . . . . . . . . .| $5,121                     | $(5,946)                   | $17,592                    |\n\n## Cash Flows from Operating Activities\n\nOur cash provided by operating activities is driven primarily by sales of our products and management of working capital investments.Our primary uses of cash from operating activities have been for personnel-related expenditures, manufacturing costs, marketing and promotional expenses and costs related to our facilities.Our cash flows from operating activities will continue to be affected principally by the extent to which we increase spending on our business and our working capital requirements.\n\nDuring the year ended December 31, 2019, cash used in operating activities was $0.4 million, consisting of net loss of $17.8 million, non-cash charges of $26.2 million and an unfavorable net change in operating assets and liabilities of $8.8 million.Our non-cash charges consisted primarily of stock-based compensation expense of $16.5 million and depreciation and amortization expenses of $10.0 million.The net change in our operating assets and liabilities primarily reflects an outflow from the changes in accrued liabilities and other of $5.9 million and inventory of $5.6 million, partially offset by an inflow from changes in deferred revenue of $3.2 million.\n\nThe unfavorable change in accrued liabilities and other was driven by an increase in lease liabilities associated with the lease of the San Jose corporate office.The unfavorable change in inventory was due to build up of inventory and timing of shipments, partially offset by increased reserves.The favorable change in deferred revenues was primarily driven by increased bookings.\n\nDuring the year ended December 31, 2018, cash used in operating activities was $2.7 million, consisting of net loss of $27.6 million which includes payments for our internal investigation costs of $8.6 million, non-cash charges of $25.0 million and an unfavorable net change in operating assets and liabilities of $0.1 million.Our non-cash charges consisted primarily of stock-based compensation expense of $17.0 million and depreciation and amortization expenses of $7.9 million.The net change in our operating assets and liabilities primarily reflects an inflow from the changes in deferred revenue of $7.3 million and accrued and other liabilities of $3.1 million, offset primarily by an outflow from the changes in accounts receivable of $6.1 million, prepaid expenses and other assets of $2.4 million and inventory of $1.5 million.\n\nThe favorable change in deferred revenue was primarily driven by the increase in the sale of subscription and support.The favorable change in accrued and other liabilities was primarily due to higher accrued bonuses and commissions, increased value added tax accrual due to timing of payments, and an increase in legal fees accrual.The unfavorable change in accounts receivable was attributed to timing of billing and cash collections.The unfavorable change in prepaid and other assets was mainly driven by the increase in deferred sales commissions due to higher deferred revenue and higher average commission rate.The unfavorable change in inventory was due to the timing of shipments.\n\nDuring the year ended December 31, 2017, cash provided by operating activities was $14.3 million, consisting of a net loss of $10.8 million, a cash decrease resulting from the net change in operating assets and liabilities of $1.4 million and non-cash charges of $26.4 million.Our non-cash charges consisted primarily of stock-based compensation of $17.2 million, depreciation and amortization of $8.5 million and provision for doubtful accounts and sales returns allowance of $1.1 million.The net change in our operating assets and liabilities primarily reflects an inflow from the changes in accounts receivable of $12.4 million and deferred revenue of $3.0 million, and an outflow from the change in accrued liabilities of $8.9 million, inventory of $4.7 million, prepaid expenses and other assets of $2.4 million and accounts payable of $0.9 million.","## Index to Financial Statements\n\n## Item 6.Selected Financial Data\n\nThe following table sets forth selected financial data as of and for our last five fiscal years.This selected financial data should be read in conjunction with the consolidated financial statements and related notes included in Item 15 of this Annual report.Over our last five fiscal years, we have acquired a number of companies, including NetSuite Inc. (NetSuite) in fiscal 2017.The results of our acquired companies have been included in our consolidated financial statements since their respective dates of acquisition and have contributed to our revenues, income, earnings per share and total assets.\n\nTable of Contents\n\n|                                                    |As of and for the Year Ended May 31,   |As of and for the Year Ended May 31,   |As of and for the Year Ended May 31,   |As of and for the Year Ended May 31,   |As of and for the Year Ended May 31,   | |----------------------------------------------------|----------------------------------------|----------------------------------------|----------------------------------------|----------------------------------------|----------------------------------------| | (in millions, except per share amounts)            | 2019                                   | 2018  (4)                              | 2017  (4)                              | 2016  (4)                              | 2015  (4)                              | | Consolidated Statements of Operations Data:        |                                        |                                        |                                        |                                        |                                        | | Total revenues                                     | $ 39,506                               | $ 39,383                               | $ 37,792                               | $ 37,047                               | $ 38,226                               | | Operating income                                   | $ 13,535                               | $ 13,264                               | $ 12,913                               | $ 12,604\n\n| $ 13,871                               | | Net income  (1)                                    | $ 11,083                               | $ 3,587                                | $ 9,452                                | $ 8,901                                | $ 9,938                                | | Earnings per share-diluted  (1)                    | $ 2.97                                 | $ 0.85                                 | $ 2.24                                 | $ 2.07                                 | $ 2.21                                 | | Diluted weighted average common shares outstanding | 3,732                                  | 4,238                                  | 4,217                                  | 4,305                                  | 4,503                                  | | Cash dividends declared per common share           | $ 0.81                                 | $ 0.76                                 | $ 0.64                                 | $ 0.60                                 | $ 0.51                                 | | Consolidated Balance Sheets Data:                  |                                        |                                        |                                        |                                        |                                        | | Working capital  (2)                               | $ 27,756                               | $ 57,035                               | $ 50,995\n\n| $ 47,105                               | $ 47,314                               | | Total assets  (2)                                  | $ 108,709                              | $ 137,851                              | $ 136,003                              | $ 112,180                              | $ 110,903                              | | Notes payable and other borrowings  (3)            | $ 56,167                               | $ 60,619                               | $ 57,909                               | $ 43,855                               | $ 41,958$\\_{ }$                         |"]},"response":{"0":"As of February 24, 2020, there are seven Executive Officers in the company.","1":"The company adopted ASC 606 on March 1, 2018.","2":"The table shows the years ended December 31 for the years 2019, 2018, and 2017."},"reference":{"0":"7","1":"January 1, 2018","2":"2019, 2018, 2017"},"context_recall":{"0":0.0,"1":0.0,"2":1.0},"llm_context_precision_with_reference":{"0":0.9999999999,"1":1.0,"2":1.0},"context_precision":{"0":0.9999999999,"1":1.0,"2":1.0},"faithfulness":{"0":1.0,"1":1.0,"2":1.0},"answer_relevancy":{"0":0.9264638662,"1":1.0,"2":0.9119822604}}