{"user_input":{"0":"What is the company's main cost of revenue?","1":"Why did Interest expense decrease in the year ended December 31, 2018, versus the same period in 2017?","2":"In which years was the fair value of the derivative liabilities recorded for?"},"retrieved_contexts":{"0":["revenue consists of personnel costs for our technical support team.Our cost of services revenue primarily consists of personnel costs for our professional service employees, third-party contractors, and travel-related costs.In instances where we have primary responsibility for the delivery of services, subcontractor fees are expensed as cost of services revenue.In each case, personnel costs include salaries, bonuses, benefits, and stock-based compensation.\n\nWe allocate overhead such as information technology support, information security, facilities, and other administrative costs to all functional departments based on headcount.As such, these general overhead expenses are reflected in cost of revenue and each functional operating expense.\n\n## Cost of Revenue:\n\nTable of Contents\n\n|                                          | Fiscal years ended July 31,        | Fiscal years ended July 31,        | Fiscal years ended July 31,        | Fiscal years ended July 31,        |                                    |                                    | |------------------------------------------|------------------------------------|------------------------------------|------------------------------------|------------------------------------|------------------------------------|------------------------------------| |                                          | 2019                               | 2019                               | 2018                               | 2018                               | Change                             | Change                             | |                                          | Amount                             | % of total revenue                 | Amount                             | % of total revenue                 | ($)                                | (%)                                | |                                          | (In thousands, except percentages) | (In thousands, except percentages) | (In thousands, except percentages) | (In thousands, except percentages) | (In thousands, except percentages) | (In thousands, except percentages) | | Cost of revenue:                         |                                    |                                    |                                    |\n\n|                                    |                                    | | License and subscription                 | $ 64,798                           | 9%                                 | $ 35,452                           | 5%                                 | 29,346                             | 83                                 | | Maintenance                              | 16,499                             | 2                                  | 14,783                             | 2                                  | 1,716                              | 12                                 | | Services                                 | 243,053                            | 34                                 | 246,548                            | 38                                 | (3,495)                            | (1)                                | | Total cost of revenue                    | $ 324,350                          | 45 %                               | $ 296,783                          | 45 %                               | 27,567                             | 9                                  | | Includes stock-based compensation of:    |                                    |                                    |                                    |                                    |                                    |                                    | | Cost of license and subscription revenue | $ 3,011                            |\n\n| $ 1,002                            |                                    | 2,009                              |                                    | | Cost of maintenance revenue              | 1,820                              |                                    | 1,886                              |                                    | (66 )                              |                                    | | Cost of services revenue                 | 22,781                             |                                    | 21,856                             |                                    | 925                                |                                    | | Total                                    | $ 27,612                           |                                    | $ 24,744                           |                                    | 2,868                              |                                    |\n\nThe $29.3 million increase in our cost of license and subscription revenue was primarily attributable to increases of $14.9 million in personnel expenses, $8.6 million in cloud infrastructure costs incurred in order to support the growth of our subscription offerings, $3.3 million in royalties, $1.8 million in professional services, and $0.9 million related to the amortization of internal-use software development and acquired intangible assets.Cloud infrastructure costs include $9.5 million of hosting related costs that were recorded in cost of services revenue in fiscal year 2018.The treatment of these hosting related costs is consistent with the treatment of the related revenue in each fiscal year.\n\nWe anticipate higher cost of license and subscription revenue as we continue to invest in our cloud operations to increase operational efficiency and scale while growing our customer base.\n\nCost of maintenance revenue increased by $1.7 million primarily due to the increase in personnel required to support our term and perpetual license customers.\n\nOur cost of services revenue would have increased if cloud infrastructure costs totaling $9.5 million were not reclassified to cost of license and subscription revenue, consistent with the treatment of the related revenue.Excluding the impact of this reclassification, third-party consultants billable to customers primarily for InsuranceNow implementation engagements increased by $3.2 million and personnel expenses related to new and existing employees increased by $2.8 million.\n\nWe had 781 professional service employees and 198 technical support and licensing operations employees at July 31, 2019 compared to 838 professional services employees and 121 technical support and licensing operations employees at July 31, 2018.","## Results of Operations\n\nThe following table presents certain Consolidated Statements of Operations data for the periods indicated as a percentage of total revenue:\n\n|                                    | Year Ended December 31,   | Year Ended December 31,   | |------------------------------------|---------------------------|---------------------------||                                    | 2019                      | 2018                      | | Revenue:                           |                           |                           | | Services                           | 94%                       | 93%                       | | Software and other                 | 6                         | 7                         | | Total revenue                      | 100                       | 100                       | | Cost of revenue:                   |                           |                           | | Cost of services                   | 74                        | 82                        | | Cost of software and other         | -                         | 1                         | | Total cost of revenue              | 74                        | 83                        | | Gross profit                       | 26\n\n| 17                        | | Operating expenses:                |                           |                           | | Engineering and IT                 | 7                         | 4                         | | Sales and marketing                | 3                         | 3                         | | General and administrative         | 12                        | 11                        | | Legal settlement                   | -                         | 14                        | |Total operating expenses           | 22                        | 32                        | | Income (loss) from operations      | 4                         | (15)                      | | Interest income and other, net     | 2                         | 1                         | | Income (loss), before income taxes | 6                         | (14)                      | | Income tax provision               | -                         | -                         | | Income (loss), after income taxes  | 6%                        | (14)%                     |\n\n## Years Ended December 31, 2019 and 2018:\n\n## Revenue\n\n|                    | %Change 2018   | %Change 2018   | % Change 2018   | |--------------------|-----------------|-----------------|-----------------| | ($ in thousands)   | 2019            | to 2019         | 2018            | | Services           | $ 59,545        | (8)%            | $ 64,476        | | Software and other | 3,788           | (25)%           | 5,073           | | Total revenue      | $ 63,333        | (9)%            | $ 69,549        |\n\nServices .Services revenue consists primarily of fees for customer support services generated from our partners.We provide these services remotely, generally using personnel who utilize our proprietary technology to deliver the services.Services revenue is also comprised of licensing of our Support.com Cloud applications.Services revenue for the year ended December 31, 2019 decreased by $4.9 million from 2018.The decrease in service revenue was primarily due to the decrease in the billable hours of our major customers.For the year ended December 31, 2019, services revenue generated from our partnerships was $56.6 million compared to $61.0 million for 2018.For the year ended December 31, 2019, direct services revenue was $2.9 million compared to $3.5 million for 2018.As with any market that is undergoing shifts, timing of downward pressures and growth opportunities in our services programs are difficult to predict.We are experiencing downward pressure with some of our services programs as pers onal computer and certain retail markets are subject to internal re-alignment and other sector specific softness.H owever, we still see opportunity in the market for growth with our service partners as a result of the evolving support market trends."],"1":["Other income and expense items are summarized in the following table:\n\nTable of Contents\n\n|                                   | Years Ended December 31,   | Years Ended December 31,   | |-----------------------------------|----------------------------|----------------------------||                                   | 2018                       | 2017                       | | Interest expense                  | $ (2,085) $                | (3,343)                    | | Interest income                   | 1,826                      | 1,284                      | |Other (expense) income            | (2,676)                    | 3,817                      | |Total other (expense) income, net | $ (2,935) $                | 1,758                      |\n\nInterest expense decreased in the year ended December 31, 2018, versus the same period in 2017 primarily due to lower debt balances, a reduction in interest related to interest rate swaps, and a one-time charge related to a liability that was settled in 2017.Interest income increased due to higher interest rates.Other expense in the year ended December 31, 2018, was driven by foreign currency translation losses mainly due to the appreciation of the U.S. Dollar compared to the Chinese Renminbi and the Euro.Other income in the year ended December 31, 2017 was driven mainly by foreign currency translation gains due to the depreciation of the U.S. Dollar compared to the Chinese Renminbi and the Euro.\n\n|                    | Years Ended December 31,   | Years Ended December 31,   | |--------------------|----------------------------|----------------------------||                    | 2018                       | 2017                       | |Effective tax rate | 19.9%                      | 64.1%                      |\n\nThe effective income tax rate in 2018 was 19.9% compared to 64.1% in the prior year.The tax rate in 2018 was favorably impacted by a discrete one-time rate change benefit related to the Tax Act resulting from the election of tax accounting method changes, partially offset by a one-time withholding tax on repatriation of earnings from one of our foreign subsidiaries that was completed during the year to enable the use of tax credits due to expire in 2018.The tax rate in 2017 was unfavorably impacted by the application of the Tax Act, driven by the remeasurement of the net deferred tax assets from 35% to 21% and the one-time mandatory transition tax on the historical earnings of foreign affiliates, which resulted in a net non-cash charge of $18,001.\n\nNet earnings were $46,532 or $1.39 per diluted share for the year ended December 31, 2018, compared to earnings of $14,448 or $0.43 per diluted share in the comparable period of 2017.\n\n## Liquidity and Capital Resources\n\nCash and cash equivalents were $100,241 at December 31, 2019, and $100,933 at December 31, 2018, of which $98,309 and $96,762, respectively, were held outside the United States.The decrease in cash and cash equivalents of $692 was primarily driven by cash generated from operating activities of $64,405 and net proceeds from an increase in borrowings of long-term debt of $49,700, which were offset by the payment for the QTI acquisition of $73,906, capital expenditures of $21,733, treasury stock purchases of $11,746, dividends paid of $5,238, and taxes paid on behalf of equity award participants of $2,657.Total debt as of December 31, 2019, and December 31, 2018, was $99,700 and $50,000, respectively.Total debt as a percentage of total capitalization, defined as long-term debt as a percentage of total debt and shareholders'equity, was 19.7% at December 31, 2019, compared to 11.7% at December 31, 2018.\n\nWorking capital increased by $5,164 from December 31, 2018, to December 31, 2019, driven mainly by the decrease in accrued payroll and benefits due to lower short-term incentive compensation and the decrease in accounts payable, which were partially offset by an increase in operating lease obligations.\n\n## Cash Flows from Operating Activities\n\nNet cash provided by operating activities was $64,405 during the year ended December 31, 2019.Components of net cash provided by operating activities included net earnings of $36,146, depreciation and amortization expense of $24,619, stock-based compensation of $5,015, other net non-cash items totaling $5,160, and a net cash outflow from changes in assets and liabilities of $6,535.","|                               | Years Ended October 31,   | Years Ended October 31,   | Years Ended October 31,   | |-------------------------------|---------------------------|---------------------------|---------------------------| |                               | 2019                      | 2018                      | 2017                      | |                               | (In thousands)            | (In thousands)            | (In thousands)            | |Current expense (benefit):    |                           |                           |                           | | Federal                       | $ (735)                   | $ (600)                   | $ 117,611                 | | State                         | (51)                      | (1,169)                   | 11,024                    |\n\n|                               | (786)                     | (1,769)                   | 128,635                   | |Deferred expense (benefit):   |                           |                           |                           | | Federal                       | 13,966                    | (28,845)                  | 15,452                    | | State                         | 2,753                     | 2,146                     | 1,804                     | | Change in valuation allowance | (5,380)                   | (2,406)                   | (1,106)                   | |                               | 11,339                    | (29,105)                  | 16,150                    | | Income tax expense (benefit)  | $ 10,553                  | $ (30,874)                | $ 144,785                 |\n\nSignificant components of the Company's deferred tax assets and liabilities are outlined below.\n\n|                                          | October 31,    | October 31,    | |------------------------------------------|----------------|----------------| |                                          | 2019           | 2018           | |                                          | (In thousands)| (In thousands)| | Deferred tax liabilities:                |                |                | | Property, plant and equipment            | $ 148,505      | $ 88,351       | | Prepaid and other assets                 | 1,911          | 1,751          | | Total deferred tax liabilities           | 150,416        | 90,102         | | Deferred tax assets:                     |                |                | | Accrued expenses and accounts receivable | 8,172          | 7,814          | | Inventory                                | 1,155          | 2,862          | | Compensation on restricted stock         | 7,528          | 8,280          | | State income tax credits                 | 9,333          | 12,235         | | Other                                    | 1,272          | 654            | | Valuation allowance                      | (5,637)        | (11,017)       | |Net operating loss                       | 54,461         | 6,481          | | Total deferred tax assets                | 76,284         | 27,309         | | Net deferred tax liabilities             | $ 74,132       | $ 62,793       |\n\nThe increase in the Company's deferred tax liability is primarily attributable to the Company's decision to take bonus depreciation on qualifying assets placed in service during fiscal 2019.\n\nIncluded in the deferred tax assets at October 31, 2019, is a federal NOL carryforward of $255.4 million.All of the NOL carryforward was incurred subsequent to the enactment of the TCJA and therefore has an indefinite carryforward period.The Company has significant deferred tax liabilities, primarily related to property, plant and equipment, which are expected to reverse and allow for the full utilization of the NOL carryforward.As such, the Company has not recorded a valuation allowance related to the NOL carryforward.Also included in the deferred tax assets are North Carolina Investing in Business Property Credit and North Carolina Jobs Credits totaling $4.9 million, as well as Georgia Job Tax Credits totaling $2.6 million.The North Carolina Investing in Business Property Credit provides a 7% investment tax credit for property located in a North Carolina development area, the North Carolina Creating Jobs Credit provides a tax credit for increased employment in North Carolina, and the Georgia Job Tax Credit provides a tax credit for creation and retention of qualifying jobs in Georgia.It is management's opinion that the majority of the North Carolina and Georgia income tax credits will not be utilized before they expire, and a $5.6 million valuation allowance has been recorded as of October 31, 2019.The North Carolina credits began to expire during fiscal 2018, and the remaining credits expire between fiscal years 2020 and 2023."],"2":["The following table presents the fair value of our derivatives instruments on a gross basis:\n\n| (In millions)          | Level 1   | Level 2   | Level 3   | Total   | |------------------------|-----------|-----------|-----------|---------| | June 30, 2019          |           |           |           |         | |Derivative assets      | $ 0       | $ 247     | $  3      | $ 250   | | Derivative liabilities | 0         | (272)     | 0         | (272)   | | June 30, 2018          |           |           |           |         | |Derivative assets      | 1         | 535       | 2         | 538     | | Derivative liabilities | (1)       | (206)     | 0         | (207)   |\n\n## Fair Value Hedge Gains (Losses)\n\nWe recognized in other income (expense), net the following gains (losses) on contracts designated as fair value hedges and their related hedged items:\n\n| (In millions)                                                     |       |         |        | |-------------------------------------------------------------------|-------|---------|--------|| Year Ended June 30,                                               | 2019  | 2018    | 2017   | | Foreign Exchange Contracts                                        |       |         |        || Derivatives                                                       | $ 38  | $  25   | $ 441  | | Hedged items                                                      | 130   | 78      | (386)  | | Total amount of ineffectiveness                                   | $ 168 | $ 103   | $  55  | | Equity Contracts                                                  |       |         |        | |Derivatives                                                       | $ 0   | $ (324) | $ (74) | | Hedged items                                                      | 0     | 324     | 74     | | Total amount of ineffectiveness                                   | $ 0   | $  0    | $  0   | | Amount of equity contracts excluded from effectiveness assessment | $  0  | $ 80    | $ (80) |\n\n## Cash Flow Hedge Gains (Losses)\n\nWe recognized the following gains (losses) on foreign exchange contracts designated as cash flow hedges:\n\n|                                                                                        |(In millions)   | (In millions)   | (In millions)   | |----------------------------------------------------------------------------------------|-----------------|-----------------|-----------------| | Year Ended June 30,                                                                    | 2019            | 2018            | 2017            | | Effective Portion                                                                      |                 |                 |                 | | Gains recognized in other comprehensive income (loss), net of tax of  $1 , $11, and $4 | $ 159           | $ 219           | $ 328           | | Gains reclassified from accumulated other comprehensive income (loss) into revenue     | 341             | 185             | 555             | | Amount Excluded from Effectiveness Assessment and Ineffective Portion                  |                 |                 |                 | |Losses recognized in other income (expense), net                                       | (64)            | (255)           | (389)           |\n\nWe do not have any net derivative gains included in AOCI as of June 30, 2019 that will be reclassified into earnings within the following 12 months.No significant amounts of gains (losses) were reclassified from AOCI into earnings as a result of forecasted transactions that failed to occur during fiscal year 2019.","## GasLog Ltd. and its Subsidiaries\n\n## Notes to the consolidated financial statements (Continued)\n\nFor the years ended December 31, 2017, 2018 and 2019\n\n(All amounts expressed in thousands of U.S. Dollars, except share and per share data)\n\n## 26.Derivative Financial Instruments (Continued)\n\nThe fair value of the derivative liabilities is as follows:\n\n|                                                                                              | As of December 31,   | As of December 31,   | |----------------------------------------------------------------------------------------------|----------------------|----------------------||                                                                                              | 2018                 | 2019                 | |Derivative liabilities carried at fair value through profit or loss (FVTPL)                  |                      |                      | | Interest rate swaps ....................................                                     | 9,196                | 49,891               | |Forward foreign exchange contracts .......................                                   | 1,467                | 41                   |\n\n| Derivative liabilities designated and effective as hedging instruments carried at fair value |                      |                      | | Cross currency swaps ..................................                                      | 1,429                | -                    | | Total ..............................................                                         | 12,092               | 49,932               | | Derivative financial instruments, current liability ..............                           | 2,091                | 8,095                | | Derivative financial instruments, non-current liability ...........                          | 10,001               | 41,837               | | Total ..............................................                                         | 12,092               | 49,932               |\n\n## Interest rate swap agreements\n\nThe Group enters into interest rate swap agreements which convert the floating interest rate exposure into a fixed interest rate in order to hedge a portion of the Group's exposure to fluctuations in prevailing market interest rates.Under the interest rate swaps, the bank counterparty effects quarterly floating-rate payments to the Group for the notional amount based on the U.S. dollar LIBOR, and the Group effects quarterly payments to the bank on the notional amount at the respective fixed rates.\n\n## Interest rate swaps designated as cash flow hedging instruments\n\nAs of December 31, 2018 and 2019, there are no interest rate swaps designated as cash flow hedging instruments for accounting purposes."]},"response":{"0":"The company's main cost of revenue consists of personnel costs for its technical support team and professional service employees, as well as third-party contractors and travel-related costs.","1":"Interest expense decreased in the year ended December 31, 2018, versus the same period in 2017 primarily due to lower debt balances, a reduction in interest related to interest rate swaps, and a one-time charge related to a liability that was settled in 2017.","2":"The fair value of the derivative liabilities is recorded for the years ended December 31, 2018, and December 31, 2019, as per the provided information."},"reference":{"0":"Products, Services","1":"primarily due to lower debt balances, a reduction in interest related to interest rate swaps, and a one-time charge related to a liability that was settled in 2017.","2":"2018, 2019"},"context_recall":{"0":1.0,"1":1.0,"2":1.0},"llm_context_precision_with_reference":{"0":1.0,"1":1.0,"2":1.0},"context_precision":{"0":1.0,"1":1.0,"2":1.0},"faithfulness":{"0":1.0,"1":1.0,"2":1.0},"answer_relevancy":{"0":0.9587300971,"1":0.9974418225,"2":0.9220159616}}