{"user_input":{"0":"What financial items does operating free cash flow consist of?","1":"What was the Net operating loss carry forward in 2019?","2":"Which market is the common stock traded at?"},"retrieved_contexts":{"0":["Free Cash Flow ( non-U .S .GAAP measure ).We also present Free Cash Flow, which is a non-U.S. GAAP measure, defined as (i) net cash from operating activities plus (ii) net cash used in investing activities, excluding payment for purchases (and proceeds from the sale) of marketable securities, and net cash variation for joint ventures deconsolidation, which are considered as temporary financial investments.The result of this definition is ultimately net cash from operating activities plus payment for purchase and proceeds from sale of tangible, intangible and financial assets, proceeds received in the sale of businesses and cash paid for business acquisitions.We believe Free Cash Flow, a non-U.S. GAAP measure, provides useful information for investors and management because it measures our capacity to generate cash from our operating and investing activities to sustain our operations.Free Cash Flow is not a U.S. GAAP measure and does not represent total cash flow since it does not include the cash flows generated by or used in financing activities.Free Cash Flow reconciles with the total cash flow and the net cash increase (decrease) by including the payment for purchases (and proceeds from the sale) of marketable securities and net cash variation from joint ventures deconsolidation, the net cash from (used in) financing activities and the effect of changes in exchange rates.\n\nIn addition, our definition of Free Cash Flow may differ from definitions used by other companies.Free Cash Flow is determined from our Consolidated Statements of Cash Flows as follows:\n\nTable of Contents\n\n|                                                                                                                                   | Year Ended December 31,   | Year Ended December 31,   | Year Ended December 31,   | |-----------------------------------------------------------------------------------------------------------------------------------|---------------------------|---------------------------|---------------------------| |                                                                                                                                   | 2019                      | 2018                      | 2017                      | |                                                                                                                                   | (In millions)             | (In millions)             | (In millions)             | | Net cash from operating activities                                                                                                | $ 1,869                   | $ 1,845                   | $ 1,677                   |\n\n| Net cash used in investing activities                                                                                             | (1,172 )                  | (1,212 )                  | (1,468 )                  | |Excluding:                                                                                                                        |                           |                           |                           | | Payment for purchase and proceeds from sale of  marketable securities, and net cash variation for  joint ventures deconsolidation | (200 )                    | (100 )                    | 99                        || Payment for purchase and proceeds from sale of  tangible and intangible assets, payment for  business acquisitions (1)            | (1,372 )                  | (1,312 )                  | (1,369 )                  | |Free Cash Flow (non-U.S. GAAP measure)                                                                                            | $ 497                     | $ 533                     | $ 308                     |\n\nFree Cash Flow was positive $497 million in 2019, compared to positive $533 million and positive $308 million in 2018 and 2017, respectively.","## Statements of Cash Flows\n\nThe following table summarizes our cash flow related activities (in thousands):\n\n|                                                                                                                    | Years Ended December 31,   | Years Ended December 31,   | Years Ended December 31,   | |--------------------------------------------------------------------------------------------------------------------|----------------------------|----------------------------|----------------------------| |                                                                                                                    | 2019                       | 2018                       | 2017                       | | Cash (used in) provided by:                                                                                        |                            |                            |                            | | Operating activities . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| $ (426)                    | $(2,694)                   | $14,314                    | | Investing activities .. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| (251)                      | (6,876)                    | (5,142)                    | | Financing activities . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 5,798                      | 3,624                      | 8,420                      | | Net increase (decrease) in cash and cash equivalents ..\n\n. . . . . . . . . . . . . . . . . . . .| $5,121                     | $(5,946)                   | $17,592                    |\n\n## Cash Flows from Operating Activities\n\nOur cash provided by operating activities is driven primarily by sales of our products and management of working capital investments.Our primary uses of cash from operating activities have been for personnel-related expenditures, manufacturing costs, marketing and promotional expenses and costs related to our facilities.Our cash flows from operating activities will continue to be affected principally by the extent to which we increase spending on our business and our working capital requirements.\n\nDuring the year ended December 31, 2019, cash used in operating activities was $0.4 million, consisting of net loss of $17.8 million, non-cash charges of $26.2 million and an unfavorable net change in operating assets and liabilities of $8.8 million.Our non-cash charges consisted primarily of stock-based compensation expense of $16.5 million and depreciation and amortization expenses of $10.0 million.The net change in our operating assets and liabilities primarily reflects an outflow from the changes in accrued liabilities and other of $5.9 million and inventory of $5.6 million, partially offset by an inflow from changes in deferred revenue of $3.2 million.\n\nThe unfavorable change in accrued liabilities and other was driven by an increase in lease liabilities associated with the lease of the San Jose corporate office.The unfavorable change in inventory was due to build up of inventory and timing of shipments, partially offset by increased reserves.The favorable change in deferred revenues was primarily driven by increased bookings.\n\nDuring the year ended December 31, 2018, cash used in operating activities was $2.7 million, consisting of net loss of $27.6 million which includes payments for our internal investigation costs of $8.6 million, non-cash charges of $25.0 million and an unfavorable net change in operating assets and liabilities of $0.1 million.Our non-cash charges consisted primarily of stock-based compensation expense of $17.0 million and depreciation and amortization expenses of $7.9 million.The net change in our operating assets and liabilities primarily reflects an inflow from the changes in deferred revenue of $7.3 million and accrued and other liabilities of $3.1 million, offset primarily by an outflow from the changes in accounts receivable of $6.1 million, prepaid expenses and other assets of $2.4 million and inventory of $1.5 million.\n\nThe favorable change in deferred revenue was primarily driven by the increase in the sale of subscription and support.The favorable change in accrued and other liabilities was primarily due to higher accrued bonuses and commissions, increased value added tax accrual due to timing of payments, and an increase in legal fees accrual.The unfavorable change in accounts receivable was attributed to timing of billing and cash collections.The unfavorable change in prepaid and other assets was mainly driven by the increase in deferred sales commissions due to higher deferred revenue and higher average commission rate.The unfavorable change in inventory was due to the timing of shipments.\n\nDuring the year ended December 31, 2017, cash provided by operating activities was $14.3 million, consisting of a net loss of $10.8 million, a cash decrease resulting from the net change in operating assets and liabilities of $1.4 million and non-cash charges of $26.4 million.Our non-cash charges consisted primarily of stock-based compensation of $17.2 million, depreciation and amortization of $8.5 million and provision for doubtful accounts and sales returns allowance of $1.1 million.The net change in our operating assets and liabilities primarily reflects an inflow from the changes in accounts receivable of $12.4 million and deferred revenue of $3.0 million, and an outflow from the change in accrued liabilities of $8.9 million, inventory of $4.7 million, prepaid expenses and other assets of $2.4 million and accounts payable of $0.9 million."],"1":["## Tax Carryforwards\n\nThe amount and expiration dates of income tax net operating loss carryforwards and tax credit carryforwards, which are available to reduce future taxes, if any, as of August 31, 2019 are as follows:\n\n| (dollars in thousands)                                      | Last Fiscal Year of Expiration   | Amount   | |-------------------------------------------------------------|----------------------------------|----------| | Income tax net operating loss carryforwards: (1)            |                                  |          | | Domestic - state .........................................  | 2039                             | $ 57,299 | | Foreign ................................................    | 2039 or indefinite               | $565,609 | | Tax credit carryforwards:(1)                               |                                  |          | |Domestic - federal .......................................  | 2029                             | $ 39,784 | | Domestic - state .........................................  | 2027                             | $ 3,313  | | Foreign (2) ...............................................| 2027 or indefinite               | $ 15,345 |\n\n## Unrecognized Tax Benefits\n\nReconciliation of the unrecognized tax benefits is summarized below (in thousands):\n\n|                                                                                                                                       | Fiscal Year Ended August 31,   | Fiscal Year Ended August 31,   | Fiscal Year Ended August 31,   ||---------------------------------------------------------------------------------------------------------------------------------------|--------------------------------|--------------------------------|--------------------------------| |                                                                                                                                       | 2019                           | 2018                           | 2017                           | | Beginning balance ...............................................                                                                     | $256,705                       | $201,355                       | $149,898                       | | Additions for tax positions of prior years .............................                                                              | 20,158                         | 14,465                         | 2,155                          | | Reductions for tax positions of prior years (1) ..........................                                                            | (106,252)                      | (21,045)                       | (12,233)                       | | Additions for tax positions related to current year (2) ....................\n\n| 35,769                         | 81,866                         | 77,807                         | | Cash settlements ................................................                                                                     | -                              | (1,659)                        | (2,298)                        | | Reductions from lapses in statutes of limitations .......................                                                             | (2,570)                        | (7,496)                        | (10,446)                       | | Reductions from settlements with taxing authorities (3) ...................                                                           | (35,582)                       | (5,928)                        | (6,061)                        | | Foreign exchange rate adjustment ..................................                                                                   | (3,845)                        | (4,853)                        | 2,533                          | | Ending balance .................................................                                                                      | $164,383                       | $256,705                       | $201,355                       | | Unrecognized tax benefits that would affect the effective tax rate (if recognized) ..................................................| $ 93,237                       | $117,455                       | $ 75,223\n\n|\n\nThe Company recognizes interest and penalties related to unrecognized tax benefits in income tax expense.The Company's accrued interest and penalties were approximately $18.9 million and $20.4 million as of August 31, 2019 and 2018, respectively.The Company recognized interest and penalties of approximately $(1.5) million, $(6.7) million and $5.2 million during the fiscal years ended August 31, 2019, 2018 and 2017, respectively.\n\nIt is reasonably possible that the August 31, 2019 unrecognized tax benefits could decrease during the next 12 months by $5.8 million, primarily related to a state settlement.","Significant components of the Company's deferred tax liabilities and assets were as follows:\n\nTable of Contents\n\n|                                    | June 1, 2019   | June 2, 2018   | |------------------------------------|----------------|----------------|| Deferred tax liabilities:          |                |                | | Property, plant and equipment      | $ 49,275       | $ 47,899       | | Inventories                        | 27,750         | 25,494         | | Investment in affiliates           | 7,609          | 7,996          | | Other comprehensive income         | 324            | -              | | Other                              | 2,596          | 1,616          | | Total deferred tax liabilities     | 87,554         | 83,005         | |Deferred tax assets:               |                |                | | Accrued expenses                   | 2,170          | 3,013          | | State operating loss carryforwards | 133            | 566            | | Other comprehensive loss           | -              | 95             | | Other                              | 2,654          | 3,276          | | Total deferred tax assets          | 4,957          | 6,950          | |Net deferred tax liabilities       | $ 82,597       | $ 76,055       |\n\nThe differences between income tax expense (benefit) at the Company's effective income tax rate and income tax expense at the statutory federal income tax rate were as follows: ?\n\n|                                        | Fiscal year end   | Fiscal year end   | Fiscal year end   | |----------------------------------------|-------------------|-------------------|-------------------||                                        | June 1, 2019      | June 2, 2018      | June 3, 2017      | | Statutory federal income tax (benefit) | $ 14,694          | $ 34,105          | $ (39,950)        | | State income tax (benefit)             | 2,164             | 3,200             | (3,193)           | |Domestic manufacturers deduction       | -                 | (2,545)           | 4,095             | |Enacted rate change                    | -                 | (42,973)          | -                 | | Tax exempt interest income             | (197)             | (101)             | (206)             | | Other, net                             | (918)             | (545)             | (613)             | |                                        | $ 15,743          | $ (8,859)         | $ (39,867)        |\n\nIn December 2017, the President of the United States signed into law the Tax Cuts and Jobs Act of 2017 (the \"Act\"), which among other matters reduced the United States corporate tax rate from 35% to 21% effective January 1, 2018.In fiscal 2018, the Company recorded a $43 million tax benefit primarily related to the remeasurement of certain deferred tax assets and liabilities.\n\nFederal and state income taxes of $36.5 million, $2.1 million, and $3.7 million were paid in fiscal years 2019, 2018, and 2017, respectively.Federal and state income taxes of $418,000, $47.2 million, and $17.6 million were refunded in fiscal years 2019, 2018, and 2017, respectively.\n\nThe Company may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position.The Company measures the tax benefits recognized based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate resolution.As of June 1, 2019, there were no uncertain tax positions that resulted in any adjustment to the Company's provision for income taxes.\n\nTable of Contents\n\nWe are under audit by the IRS for the fiscal years 2013 through 2015.We are subject to income tax in many jurisdictions within the U.S., and certain jurisdictions are under audit by state and local tax authorities.The resolutions of these audits are not expected to be material to our consolidated financial statements.Tax periods for all years beginning with fiscal year 2013 remain open to examination by federal and state taxing jurisdictions to which we are subject.\n\n## 12.Contingencies\n\n## Financial Instruments\n\nThe Company maintained standby letters of credit (\"LOC\") with banks totaling $4.2 million at June 1, 2019, of which $3.7 million where issued under the Company's Revolving Credit Facility with the remainder collateralized with cash.The cash collateralized LOCs are included in the line item \"Other assets\" in the consolidated balance sheets.The outstanding LOCs are for the benefit of certain insurance companies.None of the LOCs are recorded as a liability on the Consolidated Balance Sheets.\n\n## Egg Antitrust Litigation\n\nOn September 25, 2008, the Company was named as one of several defendants in numerous antitrust cases involving the United States shell egg industry.The cases were consolidated into In re: Processed Egg Products Antitrust Litigation, No. 2:08-md-02002-GP, in the United States District Court for the Eastern District of Pennsylvania (the \"District Court\"), in three groups of cases - the \"Direct Purchaser Putative Class Action\", the \"Indirect Purchaser Putative Class Action\" and the \"Non-Class Cases.\"\n\nThe Direct Purchaser Putative Class Action.The named plaintiffs in these cases alleged that they purchased eggs or egg products directly from a defendant and sued on behalf of themselves and a putative class of others who claimed to be similarly situated.As previously reported, in November 2014, the District Court approved the Company's settlement with the direct purchaser plaintiff class and entered final judgment dismissing with prejudice the class members' claims against the Company.\n\nThe Indirect Purchaser Putative Class Action.The named plaintiffs in these cases are individuals or companies who allege that they purchased shell eggs indirectly from one or more of the defendants - that is, they purchased from retailers that had previously purchased from defendants or other parties - and sued on behalf of themselves and a putative class of others who claim to be similarly situated.The District Court denied the indirect purchaser plaintiffs' motion for class certification.On June 28, 2018, the Company entered into a settlement agreement with the indirect purchaser plaintiffs, for an immaterial amount, and on July 17, 2018, the Court entered an order dismissing all indirect purchaser plaintiffs' claims against the Company and other defendants.\n\nThe Non-Class Cases.In the remaining cases, the named plaintiffs allege that they purchased shell eggs and egg products directly from one or more of the defendants but sue only for their own alleged damages and not on behalf of a putative class.On April 4, 2018, the Court entered a final judgement dismissing all claims against the Company brought by the following non-class plaintiffs: The Kroger Co.; Publix Super Markets, Inc.; SUPERVALU, Inc.; Safeway, Inc.; Albertsons LLC; H.E. Butt Grocery Co.; The Great Atlantic & Pacific Tea Company, Inc.; Walgreen Co.; HyVee, Inc.; and Giant Eagle, Inc., with prejudice, pursuant to the Company's previously announced $80.8 million settlement with the named plaintiffs.\n\nThe Company settled all Non-Class cases except for the claims of certain plaintiffs who sought substantial damages allegedly arising from the purchase of egg products (as opposed to shell eggs).As previously reported, the Company settled all claims brought by one of these plaintiffs, Conopco, Inc. on a confidential basis and for an amount that did not have a material impact on the Company's financial condition or results, and on November 21, 2018, the Court entered a final judgment dismissing Conopco's claims against the Company.The remaining plaintiffs are Kraft Food Global, Inc., General Mills, Inc., Nestle USA, Inc., and The Kellogg Company (\"Egg Products Plaintiffs\").The Egg Products Plaintiffs seek treble damages and injunctive relief under the Sherman Act and are attacking certain features of the UEP animal-welfare guidelines and program used by the Company and many other egg producers.On September 6, 2016, the District Court granted defendants' motion for summary judgment and dismissed with prejudice all claims based on the purchase of egg products.That ruling was appealed to the United States Court of Appeals for the Third"],"2":["## PART II\n\n## ITEM 5 MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\n\nOur common stock is listed on the Nasdaq Global Market under the symbol \"LWAY.\"Trading commenced on March 29, 1988.As of March 16, 2020, there were approximately 147 holders of record of Lifeway's Common Stock.\n\n## Common stock price\n\nThe following table shows the high and low sale prices per share of our common stock as reported on the Nasdaq Global Market for each quarter during the two most recent fiscal years:\n\n|                | Common Stock Price Range  2018   | Common Stock Price Range  2018   ||----------------|----------------------------------|----------------------------------| |                | Low                              | High                             | | First Quarter  | $ 5.99                           | $ 8.40                           | | Second Quarter | $ 4.79                           | $ 6.48                           | | Third Quarter  | $ 2.66                           | $ 4.63                           | | Fourth Quarter | $ 1.88                           | $ 3.39                           |\n\n|                | 2019   | 2019   | |----------------|--------|--------||                | Low    | High   | | First Quarter  | $ 1.98 | $ 2.75 | | Second Quarter | $ 1.94 | $ 4.00 | | Third Quarter  | $ 2.19 | $ 3.59 | | Fourth Quarter | $ 1.87 | $ 2.44 |\n\n## Dividend Policy\n\nLifeway does not routinely declare and pay dividends.From time to time however our Board of Directors may declare and pay dividends depending on our operating cash flow, financial condition, capital requirements and such other factors as the Board of Directors may deem relevant.\n\nThere were no dividends declared or paid in fiscal 2019 or 2018.","## PART II\n\n## ITEM 5.MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES\n\nMarket Information.Our common stock is traded on the NASDAQ Global Select Market under the symbol \"JACK.\"The following table sets forth the high and low sales prices for our common stock during the fiscal quarters indicated, as reported on the NASDAQ Composite:\n\n|      | 12 Weeks Ended      | 12 Weeks Ended   | 12 Weeks Ended   | 16 Weeks  Ended   | |------|---------------------|------------------|------------------|-------------------| |      | September 29,  2019 | July 7,  2019    | April 14,  2019  | January 20,  2019 | | High | $ 91.30             | $ 87.84          | $ 85.32          | $ 90.49           | | Low  | $ 70.77             | $ 75.80          | $ 75.80          | $ 74.19           | |      | 12 Weeks Ended      | 12 Weeks Ended   | 12 Weeks Ended   | 16 Weeks  Ended   | |      | September 30,  2018 | July 8,  2018    | April 15,  2018  | January 21,  2018 | | High | $ 93.98             | $ 92.46          | $ 95.99          | $ 108.55          | | Low  | $ 81.87             | $ 79.23          | $ 79.30          | $ 90.59           |\n\nDividends.In fiscal 2019 and 2018, the Board of Directors declared four cash dividends of$0.40 per share each.Our dividend is subject to the discretion and approval of our Board of Directors and our compliance with applicable law, and depends upon, among other things, our results of operations, financial condition, level of indebtedness, capital requirements, contractual restrictions, and other factors that our Board of Directors may deem relevant.\n\nStock Repurchases.During fiscal 2019, we repurchased 1.4 million shares of our common stock at an aggregate cost of$125.3 million during the fourth quarter.As of September 29, 2019, there was approximately $175.7 million remaining under the Board-authorized stock-buyback program, which expires in November 2020.\n\n|                                        | Total number of shares purchased   | Average price paid per share   | Total number of shares purchased as part of publicly announced programs   | Maximum dollar value that may yet be purchased under these programs   | |----------------------------------------|------------------------------------|--------------------------------|---------------------------------------------------------------------------|-----------------------------------------------------------------------| | July 8, 2019 - August 4, 2019          | -                                  | -                              | -                                                                         | $ 301,019,892                                                         |\n\n| August 5, 2019 - September 1, 2019     | 852,718                            | $ 86.95                        | 852,718                                                                   | $ 226,917,560                                                         | | September 2, 2019 - September 29, 2019 | 582,223                            | $ 88.89                        | 582,223                                                                   | $ 175,702,860                                                         | | Total                                  | 1,434,941                          |                                | 1,434,941                                                                 |                                                                       |\n\n## Stockholders.As of November 15, 2019, there were 485 stockholders of record.\n\nSecurities Authorized for Issuance Under Equity Compensation Plans .The following table summarizes the equity compensation plans under which Company common stock may be issued as of September 29, 2019.Stockholders of the Company have approved all plans requiring such approval.\n\n|                                                            | (a) Number of securities to be issued upon exercise of outstanding options, warrants and rights (1)   | (b) Weighted-average exercise price of outstanding options (1)   | (c) Number of securities remaining for future issuance under equity compensation plans (excluding securities reflected in column (a))   | |------------------------------------------------------------|-------------------------------------------------------------------------------------------------------|-------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------------------------| | Equity compensation plans approved by security holders (2) | 787,141                                                                                               | $89.54                                                            | 1,821,105                                                                                                                               |\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_"]},"response":{"0":"Free Cash Flow consists of the following financial items:\n\n1. Net cash from operating activities\n2. Net cash used in investing activities, excluding:\n   - Payment for purchases and proceeds from the sale of marketable securities\n   - Net cash variation for joint ventures deconsolidation\n   - Payment for purchase and proceeds from sale of tangible and intangible assets\n   - Payment for business acquisitions\n\nUltimately, Free Cash Flow is defined as net cash from operating activities plus the payment for purchase and proceeds from the sale of tangible, intangible, and financial assets, proceeds received in the sale of businesses, and cash paid for business acquisitions.","1":"As of August 31, 2019, the net operating loss carryforwards were as follows:\n\n- Domestic - state: $57,299,000\n- Foreign: $565,609,000\n\nTotal net operating loss carryforwards: $622,908,000.","2":"Lifeway's common stock is traded on the Nasdaq Global Market under the symbol \"LWAY.\""},"reference":{"0":"Taxation, Dividends received from associates and investments, Dividends paid to non-controlling shareholders in subsidiaries, Interest received and paid","1":"$183,297","2":"NASDAQ Global Select Market"},"context_recall":{"0":0.0,"1":1.0,"2":0.3333333333},"llm_context_precision_with_reference":{"0":1.0,"1":0.9999999999,"2":1.0},"context_precision":{"0":1.0,"1":0.9999999999,"2":1.0},"faithfulness":{"0":0.5,"1":0.0,"2":null},"answer_relevancy":{"0":0.9518590706,"1":0.9468518664,"2":0.8724221294}}