{"user_input":{"0":"How is the Group's revenue diversified?","1":"What is the number of non-vested shares granted in 2019?","2":"When is the impairment of goodwill and tangible assets tested?"},"retrieved_contexts":{"0":["The following table shows summary financial performance for the Group:\n\n| $ million                                    |   2019|        | 2018 Change (%)   | |----------------------------------------------|--------|--------|-------------------| | Order intake 1                               | 532    | 470    | 13.2              | | Revenue                                      | 503.6  | 476.9  | 5.6               | | Gross profit                                 | 368.6  | 344.5  | 7.0               | | Gross margin (%)                             |  73.2  |  72.2  | 1.0               | | Adjusted operating costs 2                   | 275.7  | 267.4  | 3.1               | | Adjusted operating profit 2                  |  92.9  |  77.1  | 20.5              | | Adjusted operating margin 3  (%)             |  18.4  |  16.2  | 2.2               | | Reported operating profit                    |  88.6  |  57.5  | 54.1              | | Effective tax rate 4  (%)                    |  13    |  15.4  | (2.4)             | | Reported profit before tax                   |  89.6  |  61.2  | 46.4              | | Adjusted basic earnings per share 5  (cents) |  13.4  |  10.86 | 23.4              | | Basic earnings per share (cents)             |  12.79 |   9.14 | 39.9              | | Free cash flow 6                             | 100.1  |  50.9  | 96.7              | | Closing cash                                 | 183.2  | 121.6  | 50.7              | | Final dividend per share 7  (cents)          |   3.45 |   2.73 | 26.4              |\n\n## Notes\n\n2.Before exceptional items, acquisition related costs, acquired intangible asset amortisation and share\n\nbased payment amounting to $4.3 million in total (2018 $19.6 million).\n\n1.Order intake represents commitments from customers to purchase goods and\/or services that will ultimately result in recognised revenue.\n\n3. Adjusted operating profit as a percentage of revenue in the period.\n\n5. Adjusted basic earnings per share is based on adjusted earnings as set out in note 11 of Notes to the full year consolidated financial statements.\n\n4.Effective tax rate is the adjusted tax charge, before tax on adjusting items, expressed as a percentage of adjusted profit before tax.\n\n6.Cash flow generated from operations, less tax and net capital expenditure, interest paid and\/or received, and payment of lease liabilities\/sublease income.\n\n7.Dividends are determined in US dollars and paid in sterling at the exchange rate prevailing when the dividend is proposed.The final dividend proposed for 2019 of 3.45 cents per Ordinary Share is equivalent to 2.70 pence per Ordinary Share.\n\n## Note on Alternative Performance Measures (APMs)\n\nThe APMs adopted by the Group are defined on pages 190 and 191.The APMs which relate to adjusted income statement lines are presented and reconciled to GAAP measures using a columnar approach on the face of the income statement and can be identified by the prefix \"adjusted\" in the commentary.All APMs are clearly identified as such, with explanatory footnotes to the tables of financial information provided, and reconciled to reported GAAP measures in the Financial review or Notes to the consolidated financial statements.\n\nThe performance of the Group is assessed using a variety of performance measures, including APMs which are presented to provide users with additional financial information that is regularly reviewed by management.These APMs are not defined under IFRS and therefore may not be directly comparable with similarly identified measures used by other companies.\n\n## Revenue\n\n| $ million                      | 2019   | % of total   | 2018   | % of total   | |--------------------------------|--------|--------------|--------|--------------| | Revenue by segment             |        |              |        |              | | Networks & Security            | 319.9  | 63.5         | 285.1  | 59.8         | | Lifecycle Service Assurance    | 111.2  | 22.1         | 112.8  | 23.6         | | Connected Devices              | 72.5   | 14.4         | 79.0   | 16.6         | |                                | 503.6  | 100.0        | 476.9  | 100.0        | | Revenue by geography           |        |              |        |              | | Americas                       | 266.1  | 52.8         | 265.4  | 55.7         | | Asia Pacific                   | 187.8  | 37.3         | 159.1  | 33.3         | | Europe, Middle East and Africa | 49.7   | 9.9          | 52.4   | 11.0         | |                                | 503.6  | 100.0        | 476.9  | 100.0        |","## 3.Revenue\n\n## (a) Disaggregation of Revenue\n\nWe disaggregate our revenue into groups of similar products and services that depict the nature, amount, and timing of revenue and cash flows for our various offerings.The sales cycle, contractual obligations, customer requirements, and go-to-market strategies differ for each of our product categories, resulting in different economic risk profiles for each category.\n\nThe following table presents this disaggregation of revenue (in millions):\n\n| Years Ended                                                                                                                      | July 27, 2019   | July 28, 2018   | July 29, 2017   | |----------------------------------------------------------------------------------------------------------------------------------|-----------------|-----------------|-----------------| | Revenue:                                                                                                                         |                 |                 |                 | |Infrastructure Platforms . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| $ 30,191        | $ 28,322        | $ 27,817        | | Applications . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 5,803           | 5,036           | 4,568           | | Security . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 2,730           | 2,352           | 2,152           | | Other Products . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 281             | 999             | 1,168           | | Total Product . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 39,005          | 36,709          | 35,705          | | Services . . . . . . . ..\n\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 12,899          | 12,621          | 12,300          | | Total  (1) .. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| $ 51,904        | $ 49,330        | $ 48,005        |\n\nAmounts may not sum due to rounding.\n\nInfrastructure Platforms consist of our core networking technologies of switching, routing, wireless, and data center products that are designed to work together to deliver networking capabilities and transport and\/or store data.These technologies consist of both hardware and software offerings, including software licenses and software-as-a-service (SaaS), that help our customers build networks, automate, orchestrate, integrate, and digitize data.We are shifting and expanding more of our business to software and subscriptions across our core networking portfolio.Our hardware and perpetual software in this category are distinct performance obligations where revenue is recognized upfront upon transfer of control.Term software licenses are multiple performance obligations where the term license is recognized upfront upon transfer of control with the associated software maintenance revenue recognized ratably over the contract term.SaaS arrangements in this category have one distinct performance obligation which is satisfied over time with revenue recognized ratably over the contract term.\n\nApplications consists of offerings that utilize the core networking and data center platforms to provide their functions.The products consist primarily of software offerings, including software licenses and SaaS, as well as hardware.Our perpetual software and hardware in this category are distinct performance obligations where revenue is recognized upfront upon transfer of control.Term software licenses are multiple performance obligations where the term license is recognized upfront upon transfer of control with the associated software maintenance revenue recognized ratably over the contract term.SaaS arrangements in this category have one distinct performance obligation which is satisfied over time with revenue recognized ratably over the contract term.\n\nSecurity primarily includes our network security, cloud and email security, identity and access management, advanced threat protection, and unified threat management products.These products consist of both hardware and software offerings, including software licenses and SaaS. Updates and upgrades for the term software licenses are critical for our software to perform its intended commercial purpose because of the continuous need for our software to secure our customers' network environments against frequent threats.Therefore, security software licenses are generally represented by a single distinct performance obligation with revenue recognized ratably over the contract term.Our hardware and perpetual software in this category are distinct performance obligations where revenue is recognized upfront upon transfer of control.SaaS arrangements in this category have one distinct performance obligation which is satisfied over time with revenue recognized ratably over the contract term.\n\nOther Products primarily include our Service Provider Video Software Solutions and cloud and system management products.On October 28, 2018, we completed the sale of the SPVSS.These products include both hardware and software licenses.Our offerings in this category are distinct performance obligations where revenue is recognized upfront upon transfer of control.\n\nIn addition to our product offerings, we provide a broad range of service and support options for our customers, including technical support services and advanced services.Technical support services represent the majority of these offerings which are distinct performance obligations that are satisfied over time with revenue recognized ratably over the contract term.Advanced services are distinct performance obligations that are satisfied over time with revenue recognized as services are delivered.\n\nThe sales arrangements as discussed above are typically made pursuant to customer purchase orders based on master purchase or partner agreements.Cash is received based on our standard payment terms which is typically 30 days.We provide financing arrangements to customers for all of our hardware, software and service offerings.Refer to Note 8 for additional information.For these arrangements, cash is typically received over time.\n\n## (b) Contract Balances\n\nAccounts receivable, net was $5.5 billion as of July 27, 2019 compared to $5.6 billion as of July 28, 2018.\n\nContract assets consist of unbilled receivables and are recorded when revenue is recognized in advance of scheduled billings to our customers.These amounts are primarily related to software and service arrangements where transfer of control has occurred but we have not yet invoiced.As of July 27, 2019 and July 29, 2018, our contract assets for these unbilled receivables were $860 million and $122 million, respectively, and were included in other current assets and other assets.\n\nContract liabilities consist of deferred revenue.Deferred revenue was $18.5 billion as of July 27, 2019 compared to $19.7 billion as of July 28, 2018.In connection with the adoption of ASC 606, we recorded an adjustment to retained earnings to reduce deferred revenue by $2.8 billion.We recognized approximately $9.6 billion of revenue during fiscal 2019 that was included in the deferred revenue balance at July 29, 2018.\n\n## (c) Remaining Performance Obligations\n\nRemaining Performance Obligations (RPO) are comprised of deferred revenue plus unbilled contract revenue.As of July 27, 2019, the aggregate amount of RPO was $25.3 billion, comprised of $18.5 billion of deferred revenue and $6.8 billion of unbilled contract revenue.We expect approximately 56% of this amount to be recognized as revenue over the next year.Unbilled contract revenue represents non-cancelable contracts for which we have not invoiced, have an obligation to perform, and revenue has not yet been recognized in the financial statements.\n\n## (d) Capitalized Contract Acquisition Costs\n\nIn connection with the adoption of ASC 606, we began to capitalize direct and incremental costs incurred to acquire contracts, primarily sales commissions, for which the associated revenue is expected to be recognized in future periods.We incur these costs in connection with both initial contracts and renewals.These costs are initially deferred and typically amortized over the term of the customer contract which corresponds to the period of benefit.Deferred sales commissions were $750 million as of July 27, 2019, and was included in other current assets and other assets.The amortization expense associated with these costs was $471 million for fiscal 2019 and was included in sales and marketing expenses.\n\n## 4.Acquisitions and Divestitures\n\n## (a) Acquisition Summary\n\nWe completed five acquisitions during fiscal 2019.A summary of the allocation of the total purchase consideration is presented as follows (in millions):\n\n| Fiscal 2019                                                                                                           | Purchase  Consideration   | Net Tangible  Assets  Acquired  (Liabilities  Assumed)   | Purchased  Intangible  Assets   | Goodwill   | |-----------------------------------------------------------------------------------------------------------------------|---------------------------|----------------------------------------------------------|---------------------------------|------------| | Duo . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| $ 2,025                   | $ (57)                                                   | $ 342                           | $ 1,740    | | Luxtera . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 596                       | (19)                                                     | 319                             | 296        | |Others (three in total) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 65                        | 2                                                        | 11                              | 52         | | Total . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . ..\n\n| $ 2,686                   | $ (74)                                                   | $ 672                           | $ 2,088    |\n\nOn September 28, 2018, we completed our acquisition of privately held Duo Security, Inc. (\"Duo\"), a leading provider of unified access security and multi-factor authentication delivered through the cloud.Revenue from the Duo acquisition has been included in our Security product category.\n\nOn February 6, 2019, we completed our acquisition of Luxtera, Inc. (\"Luxtera\"), a privately held semiconductor company.Revenue from the Luxtera acquisition has been included in our Infrastructure Platforms product category.\n\nThe total purchase consideration related to our acquisitions completed during fiscal 2019 consisted of cash consideration and vested share-based awards assumed.The total cash and cash equivalents acquired from these acquisitions was approximately $100 million."],"1":["## NOTE 15\n\nShareholders' Equity\n\nShare count and par value data related to shareholders' equity are as follows:\n\nTable of Contents\n\n|                     |As of December 31,   |As of December 31,   | |---------------------|----------------------|----------------------| |                     | 2019                 | 2018                 | | Preferred Stock     |                      |                      | | Par value per share | No par value         | No par value         | |Shares authorized   | 25,000,000           | 25,000,000           | | Shares outstanding  | -                    | -                    | | Common Stock        |                      |                      | | Par value per share | No par value         | No par value         | | Shares authorized   | 75,000,000           | 75,000,000           | | Shares issued       | 56,929,298           | 56,786,849           | |Shares outstanding  | 32,472,406           | 32,750,727           | | Treasury stock      |                      |                      | |Shares held         | 24,456,892           | 24,036,122           |\n\nOn February 7, 2019, the Board of Directors authorized a stock repurchase program with a maximum dollar limit of $25,000 in stock repurchases, which replaced the previous authorized plan that was approved by our Board of Directors in April 2015.During the year ended December 31, 2019 we purchased 420,770 shares for approximately $11,746, of which $566 was repurchased under the previous plan and $11,180 was repurchased under the most recent board-authorized share repurchase program.During the year ended December 31, 2018 we purchased 342,100 shares for $9,440 under the previous authorized plan.Approximately $13,820 was available for future purchases.\n\nA roll forward of common shares outstanding is as follows:\n\n|                                  | As of December 31,   | As of December 31,   | |----------------------------------|----------------------|----------------------||                                  | 2019                 | 2018                 | | Balance at beginning of the year | 32,750,727           | 32,938,466           | | Repurchases                      | (420,770)            | (342,100)            | | Restricted stock unit issuances  | 142,449              | 154,361              | | Balance at end of period         | 32,472,406           | 32,750,727           |\n\n## NOTE 16\n\nStock\n\nBased Compensation\n\nAt December 31, 2019, we had five stock-based compensation plans: the Non-Employee Directors' Stock Retirement Plan (\"Directors' Plan\"), the 2004 Omnibus Long-Term Incentive Plan (\"2004 Plan\"), the 2009 Omnibus Equity and Performance Incentive Plan (\"2009 Plan\"), the 2014 Performance & Incentive Plan (\"2014 Plan\"), and the 2018 Equity and Incentive Compensation Plan (\"2018 Plan\").Future grants can only be made under the 2018 Plan.\n\nThese plans allow for grants of stock options, stock appreciation rights, restricted stock, restricted stock units (\"RSUs\"), performance shares, performance units, and other stock awards subject to the terms of the specific plans under which the awards are granted.\n\nThe following table summarizes the compensation expense included in selling, general and administrative expenses in the Consolidated Statements of Earnings related to stock-based compensation plans:\n\n|                        | Years Ended December 31,   | Years Ended December 31,   | Years Ended December 31,   | |------------------------|----------------------------|----------------------------|----------------------------||                        | 2019                       | 2018                       | 2017                       | | Service-Based RSUs     | $ 2,207                    | $ 2,036                    | $ 1,762                    | | Performance-Based RSUs | 2,553                      | 3,089                      | 2,350                      | | Cash-settled awards    | 255                        | 131                        | 72                         | | Total                  | $ 5,015 $                  | 5,256 $                    | 4,184                      | | Income tax benefit     | 1,133                      | 1,188                      | 1,573                      | |Net                    | $ 3,882 $                  | 4,068 $                    | 2,611                      |\n\nThe fair value of all equity awards that vested during the periods ended December 31, 2019, 2018, and 2017 were $6,589, $5,805, and $5,471, respectively.We recorded a tax deduction related to equity awards that vested during the year ended December 31, 2019, in the amount of $1,489.\n\nCTS CORPORATION 56","## Restricted Stock Units\n\nThe Company grants restricted stock units, or RSUs, to employees with various vesting terms.RSUs entitle the holder to receive, at no cost, one common share for each restricted stock unit on the vesting date as it vests.The Company withholds shares in settlement of employee tax withholding obligations upon the vesting of restricted stock units.Stock-based compensation related to grants of vested RSUs and PSUs was $3.0 million, $1.6, million and $1.0 million in 2019, 2018 and 2017, respectively.\n\nThe following table summarizes RSU's activity under the 2019 Plan and 2009 Plan, and the related weighted average grant date fair value, for 2019, 2018 and\n\n2017:\n\n|                                | RSUs & PRSUs Outstanding        | RSUs & PRSUs Outstanding               | |--------------------------------|---------------------------------|----------------------------------------| |                                | Number of Shares (in thousands)| Weighted Average Grant Date Fair Value | | Nonvested at January 1, 2017   | 98                              | $ 23.52                                | | Granted                        | 132                             | 19.74                                  | | Vested                         | (43 )                           | 20.44                                  | | Forfeited                      | (19 )                           | -                                      | |Nonvested at January 1, 2017   | 168                             | 21.56                                  |\n\n| Granted                        | 110                             | 11.90                                  | | Vested                         | (77 )                           | 19.18                                  | | Forfeited                      | (18 )                           | -                                      | |Nonvested at December 30, 2018 | 183                             | 17.22                                  | |Granted                        | 353                             | 10.77                                  | | Vested                         | (118 )                          | 14.48                                  | | Forfeited                      | (41 )                           | -                                      | |Nonvested at December 29, 2019 | 377                             | $ 12.55                                |\n\n## Employee Stock Purchase Plan\n\nThe weighted average estimated fair value, as defined by the amended authoritative guidance, of rights issued pursuant to the Company's ESPP during 2019, 2018 and 2017 was $4.28, $5.18 and $6.02, respectively.Sales under the ESPP were 24,131 shares of common stock at an average price per share of $9.76 for 2019, 31,306 shares of common stock at an average price per share of $15.40 for 2018, and 38,449 shares of common stock at an average price per share of $12.04 for 2017.\n\nAs of December 29, 2019, 62,335 shares under the 2009 ESPP remained available for issuance.The Company recorded compensation expenses related to the ESPP of $60,000, $205,000 and $153,000 in 2019, 2018 and 2017, respectively.\n\nThe fair value of rights issued pursuant to the Company's ESPP was estimated on the commencement date of each offering period using the following weighted average assumptions:\n\n|                         | Fiscal Years   | Fiscal Years   | Fiscal Years   | |-------------------------|----------------|----------------|----------------| |                         | 2019           | 2018           | 2017           | | Expected life (months)  | 6.0            | 6.0            | 6.1            | | Risk-free interest rate| 2.37 %         | 2.26 %         | 1.22 %         | | Volatility              | 54 %           | 50 %           | 53 %           || Dividend yield          | -              | -              | -              |\n\nThe methodologies for determining the above values were as follows:\n\nExpected term: The expected term represents the length of the purchase period contained in the ESPP.\n\nRisk\n\nfree interest rate: The risk\n\nfree interest rate assumption is based upon the risk\n\nfree rate of a Treasury Constant Maturity bond with a maturity appropriate for the term of the purchase period."],"2":["## 17 Impairment of Goodwill and Intangibles\n\nBefore recognition of impairment losses, the carrying amount of goodwill had been allocated as follows:\n\n|          |   31 March 2019 $M |   31 March 2018 $M | |----------|--------------------|--------------------|| Americas |              273.6 |              288.2 | | EMEA     |              413   |              434.2 | | APJ      |               98.7 |              103.6 | |          |              785.3 |              826   |\n\nImpairment of goodwill and intangible assets is tested annually, or more frequently where there is indication of impairment.\n\nWhere the asset does not generate cash flows that are independent from other assets, the Group estimates the recoverable amount of the cash-generating unit to which the asset belongs.If the recoverable amount of an asset or cash-generating unit is estimated to be less than its carrying amount, the carrying amount of the asset or cash-generating unit is reduced to its recoverable amount.An impairment loss is recognised as an expense immediately in the Consolidated Statement of Profit or Loss.\n\nGoodwill is considered impaired if the carrying value of the cash-generating unit to which it relates is greater than the higher of fair value less costs of disposal and the value in use.\n\nFor the year-ended 31 March 2019, the Directors have reviewed the value of goodwill based on internal value in use calculations.The key assumptions for these calculations are discount rates, growth rates and expected changes to billings and direct costs during the period.\n\nThe Group prepares cash flow forecasts derived from the Directors' most recent financial forecasts for the following five years.The growth rates for the five-year period are based on Directors' expectations of the medium-term operating performance of the cash-generating unit, planned growth in market share, industry forecasts, growth in the market and specific regional considerations and are in line with past experience.Discount rates have been estimated based on rates that reflect current market assessments of the Group's weighted average cost of capital.\n\nThe key assumptions used in the assessments in the year-ended 31 March 2019 are as follows:\n\n|                                                  | Americas   | EMEA   | APJ   | |--------------------------------------------------|------------|--------|-------| | Long-term regional growth rate beyond five years | 2.5%       | 1.5%   | 2.0%  | | Discount rate                                    | 9.0%       | 9.0%   | 10.0% |\n\nThe key assumptions used in the assessments in the year-ended 31 March 2018 were as follows:\n\n|                                                  | Americas   | EMEA   | APJ   | |--------------------------------------------------|------------|--------|-------| | Long-term regional growth rate beyond five years | 2.5%       | 1.5%   | 2.0%  | | Discount rate                                    | 9.5%       | 9.5%   | 10.5% |\n\nAs at 31 March 2019, there were no indicators of impairment that suggested the carrying amounts of the Group's long-lived assets are not recoverable.In order to assess the sensitivity in the assumptions made, the Directors have flexed the discount rate upward by thirty per cent of the above rates, and noted that this still did not give any indication of impairment.","The following table summarizes the changes in the carrying amount of goodwill during the fiscal years ended January 31, 2019 and 2018:\n\n|                                                                                       | January 31, 2019   | January 31, 2018   | |---------------------------------------------------------------------------------------|--------------------|--------------------| | Goodwill, beginning of the year                                                       | $ 1,769.4          | $ 1,710.3          | |Less: accumulated impairment losses, beginning of the year                            | (149.2)            | (149.2)            | | Additions arising from acquisitions during the year                                   | 866.9              |-                  | |Effect of foreign currency translation, measurement period adjustments, and other (1) | (36.3)             | 59.1               | | Goodwill, end of the year                                                             | $ 2,450.8          | $ 1,620.2          |\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n## Impairment of Long\n\nLived Assets\n\nAt least annually or more frequently as circumstances dictate, Autodesk reviews its long-lived assets for impairment whenever impairment indicators exist.Autodesk continually monitors events and changes in circumstances that could indicate the carrying amounts of its long-lived assets may not be recoverable.When such events or changes in circumstances occur, Autodesk assesses recoverability of these assets.Recoverability is measured by comparison of the carrying amounts of the assets to the future undiscounted cash flow the assets are expected to generate.If the long-lived assets are considered to be impaired, the impairment to be recognized is equal to the amount by which the carrying value of the assets exceeds its fair market value.Autodesk did not recognize any material impairments of long-lived assets during the fiscal years ended January 31, 2019, 2018, and 2017, respectively.\n\nIn addition to the recoverability assessments, Autodesk routinely reviews the remaining estimated useful lives of its longlived assets.Any reduction in the useful life assumption will result in increased depreciation and amortization expense in the quarter when such determinations are made, as well as in subsequent quarters.\n\n## Deferred Tax Assets\n\nDeferred tax assets arise primarily from tax credits, net operating losses, and timing differences for reserves, accrued liabilities, stock options, deferred revenue, purchased technologies, and capitalized intangibles, partially offset by U.S. def erred tax liabilities on acquired intangibles, and valuation allowances against U.S. and foreign deferred tax assets.Autodesk performed a quarterly assessment of the recoverability of these net deferred tax assets and believes it will generate sufficien t future taxable income in appropriate tax jurisdictions to realize the net deferred tax assets.They are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to reverse.Valuation allowances are established when necessary to reduce gross deferred tax assets to the amount that is \"more likely than not\" to b e realized.\n\n## Stock\n\nbased Compensation Expense\n\nThe following table summarizes stock-based compensation expense for fiscal 2019, 2018, and 2017, respectively, as follows:\n\n|                                                                                                                        | Fiscal Year Ended January 31,   | Fiscal Year Ended January 31,   | Fiscal Year Ended January 31,   | |------------------------------------------------------------------------------------------------------------------------|---------------------------------|---------------------------------|---------------------------------| |                                                                                                                        | 2019                            | 2018                            | 2017                            | | Cost of subscription and maintenance revenue                                                                           | $ 13.2                          | $ 11.9                          | $ 8.6                           | | Cost of other revenue                                                                                                  | 4.3                             | 4.0                             | 5.5                             | | Marketing and sales\n\n| 109.4                           | 107.3                           | 94.1                            | | Research and development                                                                                               | 82.6                            | 82.9                            | 81.3                            | | General and administrative                                                                                             | 40.0                            | 55.3                            | 32.3                            | | Stock-based compensation expense related to stock awards and Employee Qualified Stock Purchase Plan (\"ESPP\") purchases | 249.5                           | 261.4                           | 221.8                           | | Tax benefit                                                                                                            | (2.6)                           | (2.6)                           | (2.6)                           | | Stock-based compensation expense related to stock awards and ESPP purchases, net                                       | $ 246.9                         | $ 258.8                         | $ 219.2                         |\n\nAutodesk determines the grant date fair value of its share-based payment awards using a Black-Scholes Merton (\"BSM\") option pricing model or the quoted stock price on the date of grant, unless the awards are subject to market conditions, in whi ch case Autodesk uses a binomial-lattice model (e.g., Monte Carlo simulation model).The Monte Carlo simulation model utilizes multiple input variables to estimate the probability that market conditions will be achieved.Autodesk uses the following assumptions to estimate the fair value of stock-based awards:\n\n|                                    | Fiscal Year Ended January 31, 2019   | Fiscal Year Ended January 31, 2019   | Fiscal Year Ended January 31, 2019   | Fiscal Year Ended January 31, 2018   | Fiscal Year Ended January 31, 2018   | Fiscal Year Ended January 31, 2017   | Fiscal Year Ended January 31, 2017   | |------------------------------------|--------------------------------------|--------------------------------------|--------------------------------------|--------------------------------------|--------------------------------------|--------------------------------------|--------------------------------------||                                    | Stock Option Plans                   | Performance Stock Unit               | ESPP                                 | Performance Stock Unit               | ESPP                                 | Performance Stock Unit               | ESPP                                 | | Range of expected volatilities     | 37 - 42%                             | 36%                                  | 33 - 38%                             |\n\n32%                                  | 31 - 34%                             | 38 - 39%                             | 30 - 40%                             | | Range of expected lives (in years)| 0.5 - 3.8                            | N\/A                                  | 0.5 - 2.0                            | N\/A                                  | 0.5 - 2.0                            | N\/A                                  | 0.5 - 2.0                            | | Expected dividends                 | -%                                   | -%                                   | -%                                   | -%                                   | -%                                   | -%                                   | -%                                   | | Range of risk-free interest rates  | 2.3 - 2.7%                           | 2.0%                                 | 1.9 - 2.8%                           | 1.0 - 1.2%                           | 0.9 - 1.4%                           | 0.6 - 0.7%                           | 0.5 - 0.9%                           |\n\nAutodesk estimates expected volatility for stock-based awards based on the average of the following two measures: (1) a measure of historical volatility in the trading market for the Company's common stock, and (2) the implied volatility of traded forward call options to purchase shares of the Company's common stock.The expected volatility for performance stock units subject to market conditions includes the expected volatility of Autodesk's peer companies within the S&P Computer Software Select Index or S&P North American Technology Software Index with a market capitalization over $2.00 billion, depending on the award type.\n\nAutodesk estimates the expected life of stock-based awards using both exercise behavior and post-vesting termination behavior as well as consideration of outstanding options.The range of expected lives of ESPP awards are based upon the four, six-month exercise periods within a 24-month offering period.\n\nAutodesk did not pay cash dividends in fiscal 2019, 2018, or 2017 and does not anticipate paying any cash dividends in the foreseeable future.Consequently, an expected dividend yield of zero is used in the BSM option pricing model and the Monte Carlo simulation model.\n\nThe risk-free interest rate used in the BSM option pricing model and the Monte Carlo simulation model for stock-based awards is the historical yield on U.S. Treasury securities with equivalent remaining lives.\n\nAutodesk recognizes expense only for the stock-based awards that ultimately vest.Autodesk accounts for forfeitures of stock-based awards as those forfeitures occur.\n\n## Advertising Expenses\n\nAdvertising costs are expensed as incurred.Total advertising expenses incurred were $37.5 million in fiscal 2019, $31.1 million in fiscal 2018, and $33.6 million in fiscal 2017.\n\n## Net Loss Per Share\n\nBasic net loss per share is computed based on the weighted average number of shares of common stock outstanding for the period, excluding stock options and restricted stock.Diluted net loss per share is computed based upon the weighted average shares of common shares outstanding for the period and potentially dilutive common shares, including the effect of stock options and restricted stock units under the treasury stock method.\n\n## Defined Benefit Pension Plans\n\nThe funded status of Autodesk's defined benefit pension plans is recognized in the Consolidated Balance Sheets.The funded status is measured as the difference between the fair value of plan assets and the projected benefit obligation for the fiscal years presented.The projected benefit obligation represents the actuarial present value of benefits expected to be paid upon retirement based on employee services already rendered and estimated future compensation levels.The fair value of plan\n\n<!-\n\nimage -\n\n>"]},"response":{"0":"The Group's revenue is diversified both by segment and by geography.\n\n### By Segment:\n1. **Networks & Security**: $319.9 million (63.5% of total revenue)\n2. **Lifecycle Service Assurance**: $111.2 million (22.1% of total revenue)\n3. **Connected Devices**: $72.5 million (14.4% of total revenue)\n\n### By Geography:\n1. **Americas**: $266.1 million (52.8% of total revenue)\n2. **Asia Pacific**: $187.8 million (37.3% of total revenue)\n3. **Europe, Middle East and Africa**: $49.7 million (9.9% of total revenue)\n\nThis diversification shows that the Group has multiple revenue streams across different product categories and geographic regions.","1":"In 2019, a total of 353 restricted stock units (RSUs) were granted.","2":"Impairment of goodwill and intangible assets is tested annually, or more frequently where there is an indication of impairment."},"reference":{"0":"across its entire end customer base and no single end user accounted for greater than 10 per cent of the Group’s revenue in either 2018 or 2019","1":"473,550","2":"tested annually, or more frequently where there is indication of impairment"},"context_recall":{"0":0.0,"1":1.0,"2":1.0},"llm_context_precision_with_reference":{"0":1.0,"1":0.5,"2":1.0},"context_precision":{"0":1.0,"1":0.5,"2":1.0},"faithfulness":{"0":1.0,"1":0.0,"2":0.5},"answer_relevancy":{"0":1.0,"1":0.893855756,"2":0.9637159404}}