{"user_input":{"0":"What are the respective values of stock-based compensation expense related to the RSUs recognised by the company for the years ended December 31, 2019 and 2018?","1":"How much did operating income in the transportation solutions segment change by in 2019?","2":"Which years does the table provide information for the long-term deferred tax assets and long-term deferred tax liabilities for the company?"},"retrieved_contexts":{"0":["## NOTE U. STOCK\n\nBASED COMPENSATION\n\nThe following table presents total stock-based compensation cost included in income from continuing operations.\n\n| ($ in millions)                        |       |       |       | |----------------------------------------|-------|-------|-------||For the year ended December 31:        | 2019  | 2018  | 2017  | | Cost                                   | $ 100 | $ 82  | $ 91  | | Selling, general and  administrative   | 453   | 361   | 384   | | Research, development  and engineering | 126   | 67    | 59    | | Pre-tax stock-based compensation cost  | 679   | 510   | 534   | | Income tax benefits                    | (155) | (116) | (131)| | Net stock-based compensation cost      | $ 524 | $ 393 | $ 403 |\n\nTotal unrecognized compensation cost related to non-vested awards at December 31, 2019 was $1.2 billion and is expected to be recognized over a weighted-average period of approximately 2.5 years.\n\n## Incentive Awards\n\nStock-based incentive awards are provided to employees under the terms of the company's long-term performance plans (the Plans).The Plans are administered by the Executive Compensation and Management Resources Committee of the Board of Directors.Awards available under the Plans principally include restricted stock units, performance share units, stock options or any combination thereof.\n\nThere were 273 million shares originally authorized to be awarded under the company's existing Plans and 66 million shares granted under previous plans that, if and when those awards were cancelled, could be reissued under the existing Plans.At December 31, 2019, 94 million unused shares were available to be granted.\n\n## Stock Awards\n\nStock awards are made in the form of Restricted Stock Units (RSUs), including Retention Restricted Stock Units (RRSUs), or Performance Share Units (PSUs).\n\nThe following table summarizes RSU and PSU activity under the Plans during the years ended December 31, 2019, 2018 and 2017.\n\nCapitalized stock-based compensation cost was not material at December 31, 2019, 2018 and 2017.\n\n|                                                | RSUs                          | RSUs            | PSUs                          | PSUs            | |------------------------------------------------|-------------------------------|-----------------|-------------------------------|-----------------| |                                                | Weighted-Average  Grant Price | Number of Units | Weighted-Average  Grant Price | Number of Units | | Balance at January 1, 2017                     | $147                          | 8,899,092       | $155                          | 2,874,758       | | Awards granted                                 | 137                           | 3,540,949       | 137                           | 824,875         | | Awards released                                | 153                           | (3,032,531)     | 175                           | (293,236)       | | Awards canceled\/forfeited\/performance adjusted | 147                           | (852,247)       | 170                           | (757,084)*      | | Balance at December 31, 2017                   | $141                          | 8,555,263       | $144                          | 2,649,313**     |\n\n| Awards granted                                 | 121                           | 4,806,790       | 130                           | 909,140         | | Awards released                                | 148                           | (2,579,962)     | 152                           | (666,244)       | | Awards canceled\/forfeited\/performance adjusted | 139                           | (979,387)       | 147                           | (472,514)*      | | Balance at December 31, 2018                   | $130                          | 9,802,704       | $136                          | 2,419,695**     | |Awards granted                                 | 119                           | 5,650,861       | 117                           | 1,395,534       | | Awards released                                | 136                           | (3,145,016)     | 140                           | (846,672)       | | Awards canceled\/forfeited\/performance adjusted | 128                           | (981,921)       | 131                           | (112,107)*      | | Balance at December 31, 2019                   | $123                          | 11,326,628      | $126                          | 2,856,450**     |","The total fair value of RSUs and PSUs granted and vested during the years ended December 31, 2019, 2018 and 2017 were as follows:\n\n| ($ in millions)                 |      |      |      | |---------------------------------|------|------|------| |For the year ended December 31: | 2019 | 2018 | 2017 | | RSUs                            |      |      |      | |Granted                         | $674 | $583 | $484 | | Vested                          | 428  | 381  | 463  | | PSUs                            |      |      |      | |Granted                         | $164 | $118 | $113 | | Vested                          | 118  | 101  | 51   |\n\nAs of December 31, 2019, there was $1.1 billion of unrecognized compensation cost related to non-vested RSUs, which will be recognized on a straight-line basis over the remaining weightedaverage contractual term of approximately 2.5 years.\n\nIn connection with vesting and release of RSUs and PSUs, the tax benefits realized by the company for the years ended December 31, 2019, 2018 and 2017 were $131 million, $117 million and $180 million, respectively.\n\n## Stock Options\n\nIn 2016, the company made one grant of 1.5 million premiumpriced stock options.The option award was granted with a three-year cliff vesting period and a 10-year contractual term.The award's cost of $12 million was recognized ratably over the three-year vesting period.As of December 31, 2019, these options were vested with a weighted-average exercise price of $140 per share and had a remaining weighted-average contractual life of approximately 6.1 years.The options were exercisable within a range of $129 to $154.The total intrinsic value of these vested options as of December 31, 2019 was $1.9 million.\n\nThe company has not granted options since 2016.No stock options were exercised, forfeited or canceled during the years ended December 31, 2019 and 2018.The total intrinsic value of options exercised during the year ended December 31, 2017 was $7 million.In connection with this exercise, $11 million in cash was received from employees and the company realized a tax benefit of $2 million.\n\nThe company settles employee stock option exercises primarily with newly issued common shares and, occasionally, with treasury shares.Total treasury shares held at December 31, 2019 and 2018 were approximately 1,351 million and 1,341 million shares, respectively.\n\n## Acquisitions\n\nIn connection with the acquisition of Red Hat, the company issued and assumed 6.4 million stock awards with a fair value of $845 million.A share conversion ratio of 1.35 was applied to convert Red Hat's outstanding equity awards for Red Hat's common stock into IBM stock awards.At December 31, 2019, there were 4.6 million of these stock awards outstanding with a weighted-average grant price of $140 per share.\n\nIn connection with various other acquisition transactions, there was an additional 0.1 million stock options outstanding at December 31, 2019, as a result of the company's conversion of stock-based awards previously granted by acquired entities.The weighted-average exercise price of these awards was $43 per share.\n\n## IBM Employees Stock Purchase Plan\n\nThe company maintains a non-compensatory Employees Stock Purchase Plan (ESPP).The ESPP enables eligible participants to purchase shares of IBM common stock at a 5 percent discount off the average market price on the day of purchase through payroll deductions of up to 10 percent of eligible compensation.Eligible compensation includes any compensation received by the employee during the year.The ESPP provides for semi-annual offering periods during which shares may be purchased and continues as long as shares remain available under the ESPP, unless terminated earlier at the discretion of the Board of Directors.Individual ESPP participants are restricted from purchasing more than $25,000 of common stock in one calendar year or 1,000 shares in an offering period.\n\nEmployees purchased approximately 1.0 million shares under the ESPP during each year ended December 31, 2019, 2018 and 2017.Cash dividends declared and paid by the company on its common stock also include cash dividends on the company stock purchased through the ESPP.Dividends are paid on full and fractional shares and can be reinvested.The company stock purchased through the ESPP is considered outstanding and is included in the weighted-average outstanding shares for purposes of computing basic and diluted earnings per share.\n\nApproximately 18.8 million shares were available for purchase under the ESPP at December 31, 2019."],"1":["Operating income in the Transportation Solutions segment decreased $352 million in fiscal 2019 as compared to fiscal 2018.The Transportation Solutions segment's operating income included the following:\n\n|                                                                                         | Fiscal        | Fiscal        | |-----------------------------------------------------------------------------------------|---------------|---------------||                                                                                         | 2019          | 2018          | |                                                                                         | (in millions)| (in millions)| | Acquisition-related charges:                                                            |               |               | | Acquisition and integration costs                                                       | $   17        | $   8         | | Charges associated with the amortization of acquisition-related fair  value adjustments | -             | 4             | |                                                                                         | 17            | 12            | | Restructuring and other charges, net                                                    | 144           | 33            || Other items                                                                             | 14            | -             | | Total                                                                                   | $  175        | $  45         |\n\nExcluding these items, operating income decreased in fiscal 2019 primarily as a result of lower volume, unfavorable product mix, and price erosion, partially offset by lower material costs.\n\n## Industrial Solutions\n\nNet Sales.The following table presents the Industrial Solutions segment's net sales and the percentage of total net sales by industry end market$^{(1)}$:\n\n|                                  | Fiscal          | Fiscal          | Fiscal          | Fiscal          | |----------------------------------|-----------------|-----------------|-----------------|-----------------| |                                  | 2019            | 2019            | 2018            | 2018            | |                                  | ($ in millions)| ($ in millions)| ($ in millions)| ($ in millions)| | Industrial equipment             | $  1,949        | 49  %           | $  1,987        | 52  %           | | Aerospace, defense, oil, and gas | 1,306           | 33              | 1,157           | 30              | | Energy                           | 699             | 18              | 712             | 18              | | Total                            | $ 3,954         |                 | 100 % $ 3,856   | 100 %           |\n\nThe following table provides an analysis of the change in the Industrial Solutions segment's net sales by industry end market:\n\n|                                  | Change in Net Sales for Fiscal 2019 versus Fiscal 2018   | Change in Net Sales for Fiscal 2019 versus Fiscal 2018   | Change in Net Sales for Fiscal 2019 versus Fiscal 2018   | Change in Net Sales for Fiscal 2019 versus Fiscal 2018   | Change in Net Sales for Fiscal 2019 versus Fiscal 2018   | Change in Net Sales for Fiscal 2019 versus Fiscal 2018   | |----------------------------------|----------------------------------------------------------|----------------------------------------------------------|----------------------------------------------------------|----------------------------------------------------------|----------------------------------------------------------|----------------------------------------------------------| |                                  | Net Sales  Growth                                        | Net Sales  Growth                                        | Organic Net  Sales Growth                                | Organic Net  Sales Growth                                | Translation                                              | Acquisition                                              | |                                  | ($ in millions)                                          | ($ in millions)                                          | ($ in millions)                                          | ($ in millions)                                          | ($ in millions)\n\n| ($ in millions)                                          | | Industrial equipment             | $  (38)                                                  | (1.9) %                                                  | $  (66)                                                  | (3.4) %                                                  | $   (45)                                                 | $  73                                                    | | Aerospace, defense, oil, and gas| 149                                                      | 12.9                                                     | 165                                                      | 14.1                                                     | (16)                                                     | -                                                        | | Energy                           | (13)                                                     | (1.8)                                                    | 21                                                       | 2.7                                                      | (34)                                                     |-                                                        | | Total                            | $ 98                                                     | 2.5                                                      | % $ 120                                                  | 3.1\n\n| % $  (95)                                                | $   73                                                   |\n\nIn the Industrial Solutions segment, net sales increased $98 million, or 2.5%, in fiscal 2019 from fiscal 2018 due to organic net sales growth of 3.1% and sales contributions from an acquisition of 1.9%, partially offset by the negative impact of foreign currency translation of 2.5%.Our organic net sales by industry end market were as follows:\n\n$\\_{\n\n}$ Industrial equipment\n\nOur organic net sales decreased 3.4% in fiscal 2019 primarily as a result of market weakness in industrial applications, particularly in the Asia\n\nPacific and EMEA regions, partially offset by strength in medical applications.","## Results of Operations\n\nThe following table sets forth the percentage of revenue for certain items in our statements of operations for the periods indicated:\n\n|                                        | Fiscal Years   | Fiscal Years   | Fiscal Years   | |----------------------------------------|----------------|----------------|----------------| |                                        | 2019           | 2018           | 2017           | | Statements of Operations:              |                |                |                | | Revenue                                | 100 %          | 100 %          | 100 %          | | Cost of revenue                        | 43 %           | 50 %           | 55 %           | | Gross profit                           | 57 %           | 50 %           | 45 %           | | Operating expenses:                    |                |                |                |\n\n| Research and development               | 120 %          | 79 %           | 79 %           | | Selling, general and administrative    | 86 %           | 79 %           | 81 %           | | Loss from operations                   | (149 )%        | (108 )%        | (115 )%        | | Interest expense                       | (3 )%          | (1 )%          | (1 )%          | | Interest income and other expense, net | 2 %            | 1 %            | - %            | | Loss before income taxes               | (150 )%        | (108 )%        | (116 )%        | | Provision for income taxes             | 1 %            | 1 %            | 1 %            | | Net loss                               | (151 )%        | (109 )%        | (117 )%        |\n\nImpact of inflation and product price changes on our revenue and on income was immaterial in 2019, 2018 and 2017.\n\n## Comparison of Fiscal Years 2019 and 2018\n\nRevenue .The table below sets forth the changes in revenue for fiscal year ended December 29, 2019, as compared to fiscal year ended December 30, 2018 (in thousands, except percentage data):\n\n|                                     | Fiscal Years   | Fiscal Years        | Fiscal Years   | Fiscal Years        |                       |                       | |-------------------------------------|----------------|---------------------|----------------|---------------------|-----------------------|-----------------------||                                     | 2019           | 2019                | 2018           | 2018                |                       |                       | |                                     | Amount         | % of Total Revenues | Amount         | % of Total Revenues | Year-Over-Year Change | Year-Over-Year Change | | Revenue by product family $^{(1)}$:|                |                     |                |                     |                       |                       | |New products                        | $ 3,123        | 30 %                | $ 5,735        | 45 %                | $ (2,612 )            | (46 )%                | | Mature products                     | 7,187          | 70 %                | 6,894          | 55 %                | 293                   | 4 %                   | | Total revenue                       | $ 10,310       | 100 %               | $ 12,629       | 100 %               | $ (2,319 )            | (18 )%                |\n\nThe 46% decrease in new product revenue in 2019 was primarily due to lower sales from Display Bridge Solution, eFPGA license and connectivity product, which was partially offset by an increase in AI SaaS revenue.The increase in mature product revenue was due primarily to increased orders from our customers in the defense, aerospace, test and instrumentation sectors.\n\nGross Profit.The table below sets forth the changes in gross profit for fiscal year ended December 29, 2019, as compared to fiscal year ended December 30, 2018 (in thousands, except percentage data):\n\n|                 | Fiscal Years   | Fiscal Years        | Fiscal Years   | Fiscal Years        |                       |                       | |-----------------|----------------|---------------------|----------------|---------------------|-----------------------|-----------------------||                 | 2019           | 2019                | 2018           | 2018                |                       |                       | |                 | Amount         | % of Total Revenues | Amount         | % of Total Revenues | Year-Over-Year Change | Year-Over-Year Change | | Revenue         | $ 10,310       | 100 %               | $ 12,629       | 100 %               | $ (2,319 )            | (18 )%                | | Cost of revenue | 4,405          | 43 %                | 6,295          | 50 %                | (1,890 )              | (30 )%                | | Gross profit    | $ 5,905        | 57 %                | $ 6,334        | 50 %                | $ (429 )              | (7 )%                 |"],"2":["## Deferred Tax Assets and Liabilities\n\nSignificant components of the deferred tax assets and liabilities are summarized below (in thousands):\n\n|                                                                                                                                               | Fiscal Year Ended August 31,   | Fiscal Year Ended August 31,   | |-----------------------------------------------------------------------------------------------------------------------------------------------|--------------------------------|--------------------------------| |                                                                                                                                               | 2019                           | 2018                           | | Deferred tax assets:                                                                                                                          |                                |                                | |Net operating loss carry forward ....................................                                                                         | $183,297                       | $ 119,259                      | | Receivables ....................................................                                                                              | 6,165                          | 7,111                          | | Inventories .....................................................                                                                             | 9,590                          | 7,634                          | | Compensated\n\nabsences ...........................................                                                                              | 10,401                         | 8,266                          | | Accrued expenses ...............................................                                                                              | 81,731                         | 81,912                         | | Property, plant and equipment, principally due to differences in depreciation and amortization ..............................................| 66,268                         | 97,420                         | |Domestic federal and state tax credits ................................                                                                       | 42,464                         | 70,153                         | | Foreign jurisdiction tax credits .....................................                                                                        | 15,345                         | 25,887                         | | Equity compensation - Domestic ...................................                                                                            | 7,617                          | 7,566                          | | Equity compensation - Foreign .....................................                                                                           | 2,179                          | 2,401                          || Domestic federal interest\n\ncarry forward ..............................                                                                        | 5,853                          | -                              | | Cash flow hedges ................................................                                                                             | 9,878                          | -                              | | Unrecognized capital loss carry forward ..............................                                                                        | 7,799                          | -                              | | Revenue recognition .............................................                                                                             | 19,195                         | -                              | |Other .........................................................                                                                               | 21,907                         | 18,176                         | |Total deferred tax assets before valuation allowances ...................                                                                     | 489,689                        | 445,785                        | |Less valuation allowances .........................................                                                                           | (287,604)                      | (223,487)                      | |Net deferred tax assets\n\n............................................                                                                          | $202,085                       | $ 222,298                      | |Deferred tax liabilities:                                                                                                                     |                                |                                | | Unremitted earnings of foreign subsidiaries ...........................                                                                       | 75,387                         | 74,654                         | | Intangible assets .................................................                                                                           | 39,242                         | 39,122                         | |Other .........................................................                                                                               | 4,447                          | 4,655                          | | Total deferred tax liabilities ........................................                                                                       | $119,076                       | $ 118,431                      || Net deferred tax assets ..............................................                                                                        | $ 83,009                       | $ 103,867                      |\n\nBased on the Company's historical operating income, projection of future taxable income, scheduled reversal of taxable temporary differences, and tax planning strategies, management believes that it is more likely than not that the Company will realize the benefit of its deferred tax assets, net of valuation allowances recorded.The net increase in the total valuation allowance for the fiscal year ended August 31, 2019 is primarily related to the increase of a net operating loss carry forward due to a release of a non-U.S. unrecognized tax benefit and the increase of deferred tax assets in sites with existing valuation allowances.The decrease in domestic federal and state tax credits is primarily related to the utilization of tax credits against the one-time transition tax.\n\nAs of August 31, 2019, the Company intends to indefinitely reinvest the remaining earnings from its foreign subsidiaries for which a deferred tax liability has not already been recorded.The accumulated earnings are the most significant component of the basis difference which is indefinitely reinvested.As of August 31, 2019, the indefinitely reinvested earnings in foreign subsidiaries upon which taxes had not been provided were approximately $1.9 billion.The estimated amount of the unrecognized deferred tax liability on these reinvested earnings was approximately $0.2 billion.","|                               | Years Ended October 31,   | Years Ended October 31,   | Years Ended October 31,   | |-------------------------------|---------------------------|---------------------------|---------------------------| |                               | 2019                      | 2018                      | 2017                      | |                               | (In thousands)            | (In thousands)            | (In thousands)            | |Current expense (benefit):    |                           |                           |                           | | Federal                       | $ (735)                   | $ (600)                   | $ 117,611                 | | State                         | (51)                      | (1,169)                   | 11,024                    |\n\n|                               | (786)                     | (1,769)                   | 128,635                   | |Deferred expense (benefit):   |                           |                           |                           | | Federal                       | 13,966                    | (28,845)                  | 15,452                    | | State                         | 2,753                     | 2,146                     | 1,804                     | | Change in valuation allowance | (5,380)                   | (2,406)                   | (1,106)                   | |                               | 11,339                    | (29,105)                  | 16,150                    | | Income tax expense (benefit)  | $ 10,553                  | $ (30,874)                | $ 144,785                 |\n\nSignificant components of the Company's deferred tax assets and liabilities are outlined below.\n\n|                                          | October 31,    | October 31,    | |------------------------------------------|----------------|----------------| |                                          | 2019           | 2018           | |                                          | (In thousands)| (In thousands)| | Deferred tax liabilities:                |                |                | | Property, plant and equipment            | $ 148,505      | $ 88,351       | | Prepaid and other assets                 | 1,911          | 1,751          | | Total deferred tax liabilities           | 150,416        | 90,102         | | Deferred tax assets:                     |                |                | | Accrued expenses and accounts receivable | 8,172          | 7,814          | | Inventory                                | 1,155          | 2,862          | | Compensation on restricted stock         | 7,528          | 8,280          | | State income tax credits                 | 9,333          | 12,235         | | Other                                    | 1,272          | 654            | | Valuation allowance                      | (5,637)        | (11,017)       | |Net operating loss                       | 54,461         | 6,481          | | Total deferred tax assets                | 76,284         | 27,309         | | Net deferred tax liabilities             | $ 74,132       | $ 62,793       |\n\nThe increase in the Company's deferred tax liability is primarily attributable to the Company's decision to take bonus depreciation on qualifying assets placed in service during fiscal 2019.\n\nIncluded in the deferred tax assets at October 31, 2019, is a federal NOL carryforward of $255.4 million.All of the NOL carryforward was incurred subsequent to the enactment of the TCJA and therefore has an indefinite carryforward period.The Company has significant deferred tax liabilities, primarily related to property, plant and equipment, which are expected to reverse and allow for the full utilization of the NOL carryforward.As such, the Company has not recorded a valuation allowance related to the NOL carryforward.Also included in the deferred tax assets are North Carolina Investing in Business Property Credit and North Carolina Jobs Credits totaling $4.9 million, as well as Georgia Job Tax Credits totaling $2.6 million.The North Carolina Investing in Business Property Credit provides a 7% investment tax credit for property located in a North Carolina development area, the North Carolina Creating Jobs Credit provides a tax credit for increased employment in North Carolina, and the Georgia Job Tax Credit provides a tax credit for creation and retention of qualifying jobs in Georgia.It is management's opinion that the majority of the North Carolina and Georgia income tax credits will not be utilized before they expire, and a $5.6 million valuation allowance has been recorded as of October 31, 2019.The North Carolina credits began to expire during fiscal 2018, and the remaining credits expire between fiscal years 2020 and 2023."]},"response":{"0":"The values of stock-based compensation expense related to the RSUs recognized by the company for the years ended December 31 are as follows:\n\n- For the year ended December 31, 2019: $428 million (vested RSUs)\n- For the year ended December 31, 2018: $381 million (vested RSUs)","1":"Operating income in the Transportation Solutions segment decreased by $352 million in fiscal 2019 as compared to fiscal 2018.","2":"The table provides information for the long-term deferred tax assets and long-term deferred tax liabilities for the company for the fiscal years ended August 31, 2019, and August 31, 2018, as well as for the years ended October 31, 2019, 2018, and 2017."},"reference":{"0":"$0.3 million, $0.9 million","1":"decreased $352 million","2":"2019, 2018"},"context_recall":{"0":1.0,"1":1.0,"2":1.0},"llm_context_precision_with_reference":{"0":1.0,"1":1.0,"2":1.0},"context_precision":{"0":1.0,"1":1.0,"2":1.0},"faithfulness":{"0":null,"1":1.0,"2":0.5},"answer_relevancy":{"0":0.9682783215,"1":0.9628981856,"2":0.848774293}}