{"user_input":{"0":"Which factors are considered when constructing the long-term rate of return assumption for our defined benefit pension plans?","1":"What were the sales in 2019?","2":"What was the increase in FCC licenses in 2019?"},"retrieved_contexts":{"0":["return appropriate for each category of assets weighted for the distribution within the diversified investment fund.The assumptions used for the plans are based upon customary rates and practices for the location of the plans.Factors such as asse t class allocations, long-term rates of return (actual and expected), and results of periodic asset liability modeling studies ar e considered when constructing the long-term rate of return assumption for our defined benefit pension plans.\n\nWeighted average actuarial assumptions used to determine benefit obligations for the plans at the end of each period were as follows:\n\n|                               | Fiscal Year Ended January 31,   | Fiscal Year Ended January 31,   | Fiscal Year Ended January 31,   | |-------------------------------|---------------------------------|---------------------------------|---------------------------------| |                               | 2019                            | 2018                            | 2017                            | | Discount rate                 | 2.0%                            | 1.8%                            | 1.7%                            | | Rate of compensation increase | 2.7%                            | 2.6%                            | 2.6%                            |\n\nIn selecting the appropriate discount rate for the plans, the Company uses country-specific information, adjusted to reflect the duration of the particular plan .The discount rate was based on highly rated long-term bond indexes and yield curves that match the duration of the plan's benefit obligations.\n\n## Defined Contribution Plans\n\nAutodesk also provides defined contribution plans in certain foreign countries where required by statute.Autodesk's funding policy for foreign defined contribution plans is consistent with the local requirements in each country.Autodesk's contributions to these plans were $29.6 million in fiscal 2019, $27.2 million in fiscal 2018, and $26.6 million in fiscal 2017.\n\n## Cash Balance Plans\n\nAutodesk provides a cash balance plan that insures the risks of disability, death, and longevity, in which the vested pension capital is reinvested and provides a 100% capital and interest guarantee.The weighted-average guaranteed interest crediting rate for cash balance plans was 1.0%, 1.0%, and 1.3% for mandatory retirement savings and 0.3%, 0.3%, and 0.8% for supplementary retirement savings for fiscal 2019, 2018, and 2017, respectively.\n\n## Other Plans\n\nIn addition, Autodesk offers a non-qualified deferred compensation plan to certain key employees whereby they may defer a portion (or all) of their annual compensation until retirement or a different date specified by the employee in accorda nce with terms of the plan.See Note 7, \"Deferred Compensation,\" for further discussion.\n\n## 16.Restructuring and other exit costs, net\n\nDuring the fourth quarter of fiscal year 2018, the Board of Directors approved a world-wide restructuring plan (\"Fiscal 2018 Plan\") to support the Company's strategic priorities of completing the subscription transition, digitizing the Company, an d re-imagining manufacturing, construction, and production.Through the restructuring, Autodesk seeks to reduce its investments in areas not aligned with its strategic priorities, including in areas related to research and development and go-to-market activities.At the same time, Autodesk plans to further invest in strategic priority areas related to digital infrastructure, c ustomer success, and construction.By re-balancing resources to better align with the Company's strategic priorities, Autodesk is positioning itself to meet its long-term goals.This world-wide restructuring plan included a reduction in force of approximate ly 11% of the Company's workforce, or 1,027 employees, and the consolidation of certain leased facilities.By January 31, 2019, the personnel and facilities related actions included in this restructuring plan were substantially complete.\n\nDuring Fiscal 2019, restructuring charges under the Fiscal 2018 Plan included $39.2 million in employee termination benefits and $3.2 million in lease termination and other exit costs.\n\n<!-\n\nimage -\n\n>\n\nThe following tables set forth the restructuring charges and other facility exit costs, net during the fiscal years ended January 31, 2019 and 2018:\n\n|                                            | Balances, January 31, 2018   | Additions   | Payments   | Adjustments (1)   | Balances, January 31, 2019   | |--------------------------------------------|------------------------------|-------------|------------|-------------------|------------------------------| | Fiscal 2018 Plan                           |                              |             |            |                   |                              | | Employee terminations costs                | $ 53.0                       | $ 39.2      | $ (89.7)   | $ (0.5)           | $ 2.0                        | | Facility terminations and other exit costs | 2.5                          | 3.2         | (5.7)      | 0.1               | 0.1                          | | Total                                      | $ 55.5                       | $ 42.4      | $ (95.4)   | $ (0.4)           | $ 2.1                        | | Current portion (2)                        | $ 55.5                       |             |            |                   | $ 2.1                        | | Total                                      | $ 55.5                       |             |            |                   | $ 2.1                        |\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n|                                            | Balances, January 31, 2017   | Additions   | Payments   | Adjustments (1)   | Balances, January 31, 2018   | |--------------------------------------------|------------------------------|-------------|------------|-------------------|------------------------------| | Fiscal 2018 Plan                           |                              |             |            |                   |                              || Employee terminations costs                | $ -                          | $ 87.3      | $ (35.1)   | $ 0.8             | $ 53.0                       | | Facility terminations and other exit costs | -                            | 6.3         | (1.3)      | (2.5)             | 2.5                          | |Fiscal 2017 Plan                           |                              |             |            |                   |                              | | Employee termination costs                 | 1.1                          | 0.1         | (1.5)      | 0.3               | -                            |\n\n| Facility terminations and other exit costs | 1.9                          | 0.1         | (1.5)      | (0.3)             | 0.2                          | |Other facility termination costs           |                              |             |            |                   |                              | | Facility termination costs                 | 4.5                          | 0.3         | (3.0)      | (0.3)             | 1.5                          | | Total                                      | $ 7.5                        | $ 94.1      | $ (42.4)   | $ (2.0)           | $ 57.2                       | | Current portion (2)                        | $ 5.9                        |             |            |                   | $ 57.2                       | | Non-current portion (2)                    | 1.6                          |             |            |                   | -                            | | Total                                      | $ 7.5                        |             |            |                   | $ 57.2                       |\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n<!-\n\nimage -\n\n>","## Assumptions:\n\nThe following table provides the weighted average actuarial assumptions used to determine the actuarial present value of projected benefit obligations at:\n\nTable of Contents\n\n|                                 | Domestic September 30,   | Domestic September 30,   | International September 30,   | International September 30,   | |---------------------------------|--------------------------|--------------------------|-------------------------------|-------------------------------| |                                 | 2019                     | 2018                     | 2019                          | 2018                          | | Discount rate:                  | 3.00 %                   | 4.00 %                   | 1.90 %                        | 2.90 %                        | | Expected return on plan assets: |                          |                          | 3.40 %                        | 3.80 %                        | | Rate of compensation increase:  |                          |                          | - %                           | - %                           |\n\nThe following table provides the weighted average actuarial assumptions used to determine net periodic benefit cost for years ended:\n\n|                                 | Domestic September 30,   | Domestic September 30,   | International September 30,   | International September 30,   | |---------------------------------|--------------------------|--------------------------|-------------------------------|-------------------------------| |                                 | 2019                     | 2018                     | 2019                          | 2018                          | | Discount rate:                  | 4.00 %                   | 3.75 %                   | 1.90 %                        | 2.80 %                        | | Expected return on plan assets: |                          |                          | 3.40 %                        | 3.70 %                        | | Rate of compensation increase:  |                          |                          | - %                           | - %                           |\n\nFor domestic plans, the discount rate was determined by comparison against the FTSE pension liability index for AA rated corporate instruments.The Company monitors other indices to assure that the pension obligations are fairly reported on a consistent basis.The international discount rates were determined by comparison against country specific AA corporate indices, adjusted for duration of the obligation.\n\nThe periodic benefit cost and the actuarial present value of projected benefit obligations are based on actuarial assumptions that are reviewed on an annual basis.The Company revises these assumptions based on an annual evaluation of longterm trends, as well as market conditions that may have an impact on the cost of providing retirement benefits."],"1":["## Fiscal 2019 compared to Fiscal 2018\n\n## Net Sales\n\n| ($ in millions)Reporting Segment                                                                                       | Fiscal 2019 Net Sales   | Fiscal 2018 Net Sales   | % Inc (Dec)   | |-------------------------------------------------------------------------------------------------------------------------|-------------------------|-------------------------|---------------| | Grocery & Snacks. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| $ 3,279.2               | $ 3,287.0               | - %           | | Refrigerated & Frozen . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 2,804.0                 | 2,753.0                 | 2 %           | | International . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 793.4                   | 843.5                   | (6)%          | | Foodservice. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 934.2                   | 1,054.8                 | (11)%         | | Pinnacle Foods . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 1,727.6                 | -                       | 100 %         | | Total . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . ..\n\n| $ 9,538.4               | $ 7,938.3               | 20 %          |\n\nOverall, our net sales were $9.54 billion in fiscal 2019, an increase of 20% compared to fiscal 2018.\n\nGrocery & Snacks net sales for fiscal 2019 were $3.28 billion, a decrease of $7.8 million compared to fiscal 2018.Volume, excluding the impact of acquisitions and divestitures, was flat in fiscal 2019 compared to the prior-year period.This result reflected merchandising changes and price elasticity-related declines in certain brands, as well as isolated production challenges, partially offset by the continued benefit from momentum and innovation successes in the snacks businesses.Price\/ mix was flat compared to the prior year as unfavorable mix, coupled with increases in brand building investments with retailers were offset by the impact of higher pricing.The acquisition of Angie's Artisan Treats, LLC, which was completed in October 2017, contributed $41.3 million to Grocery & Snacks net sales during fiscal 2019, through the one-year anniversary of the acquisition.Fiscal 2019 results included $115.9 million of net sales related to our Wesson $^{®}$ oil business, which was sold in the fourth quarter of fiscal 2019.Fiscal 2018 results included $156.4 million of net sales related to this divested business.\n\nRefrigerated & Frozen net sales for fiscal 2019 were $2.80 billion, an increase of $51.0 million, or 2%, compared to fiscal 2018.Results for fiscal 2019 reflected a 1% increase in volume compared to fiscal 2018, excluding the impact of acquisitions.The increase in sales volumes was a result of innovation across multiple brands, which was partially offset by the effects of reduced merchandising spend and the impact of a recall during the fourth quarter.Price\/mix was flat compared to fiscal 2018, as continued delivery of top-line accretive innovation in several brands was partially offset by brand building investments with retailers.The acquisition of the Sandwich Bros. of Wisconsin ® business, which was completed in February 2018, contributed $25.7 million to Refrigerated & Frozen's net sales during fiscal 2019, through the one-year anniversary of the acquisition.\n\nInternational net sales for fiscal 2019 were $793.4 million, a decrease of $50.1 million, or 6%, compared to fiscal 2018.Results for fiscal 2019 reflected a 2% increase in volume, excluding the impact of acquisitions and divestitures, a 4% decrease due to foreign exchange rates, and a 2% increase in price\/mix, in each case compared to fiscal 2018.The volume and price\/ mix increases for fiscal 2019 were driven by growth in the Canadian snacks and frozen businesses.The acquisition of Angie's Artisan Treats, LLC contributed $3.7 million to International net sales for fiscal 2019, through the one-year anniversary of the acquisition.Fiscal 2019 included $4.1 million of net sales related to our Del Monte $^{®}$ processed fruit and vegetable business in Canada, which was sold in the first quarter of fiscal 2019.Fiscal 2018 results included $48.9 million of net sales related to this divested business.In addition, fiscal 2019 and 2018 results included $17.1 million and $24.5 million, respectively, related to our divested Wesson $^{®}$ oil business.\n\nFoodservice net sales for fiscal 2019 were $934.2 million, a decrease of $120.6 million, or 11%, compared to fiscal 2018.Results for fiscal 2019 reflected a 14% decrease in volume, excluding divestitures.The decline in volume reflected the continued execution of the segment's value-over-volume strategy and the sale of our Trenton, Missouri production facility in the first quarter of fiscal 2019.Price\/mix increased 5% in fiscal 2019 compared to fiscal 2018.The increase in price\/mix for fiscal 2019 reflected favorable product and customer mix, the impact of inflation-driven increases in pricing, and the execution of the segment's value-over-volume strategy.Fiscal 2019 included $34.2 million of net sales related to our Wesson $^{®}$ oil business, which was sold in the fourth quarter of fiscal 2019.Fiscal 2018 results included $53.4 million of net sales related to this divested business.Net sales declined by approximately 7% in fiscal 2019 due to the sale of our Trenton, Missouri production facility.\n\nPinnacle Foods net sales for fiscal 2019 (reflecting 213 days of Conagra Brands ownership) were $1.73 billion.Results reflected expected consumption declines as the Company executes its value-over-volume strategy within the Pinnacle portfolio.","## Systems Business\n\nDuring 2019, EDP Renewables, ConnectGen, and Innergex Renewable Energy each accounted for more than 10% of our systems business net sales, and the majority of our systems business net sales were in the United States and Australia.Substantially all of our systems business net sales during 2019 were denominated in U.S. dollars and Australian dollars.We typically recognize revenue for sales of solar power systems using cost based input methods, which result in revenue being recognized as work is performed based on the relationship between actual costs incurred compared to the total estimated costs for a given contract.We may also recognize revenue for the sale of a development project, which excludes EPC services, or for the sale of a completed system when we enter into the associated sales contract with the customer.The revenue recognition policies for our systems business are further described in Note 2.\"Summary of Significant Accounting Policies\" to our consolidated financial statements.\n\nThe following table shows net sales by reportable segment for the years ended December 31, 2019, 2018, and 2017:\n\n|                                                | Years Ended   | Years Ended   | Years Ended   | Change         | Change         | Change         | Change         | |------------------------------------------------|---------------|---------------|---------------|----------------|----------------|----------------|----------------|| (Dollars in thousands)                         | 2019          | 2018          | 2017          | 2019 over 2018 | 2019 over 2018 | 2018 over 2017 | 2018 over 2017 | | Modules . . . . . . . . . . . . . . . . . . .| $ 1,460,116   | $ 502,001     | $ 806,398     | $ 958,115      | 191 %          | $ (304,397)    | (38)%          | | Systems . . . . . . . . . . . . . . . . . . .| 1,603,001     | 1,742,043     | 2,134,926     | (139,042)      | (8)%           | (392,883)      | (18)%          | |Net sales. . . . . . . . . . . . . . . . . . .| $ 3,063,117   | $ 2,244,044   | $ 2,941,324   | $ 819,073      | 36 %           | $ (697,280)    | (24)%          |\n\nNet sales from our modules segment increased by $958.1 million in 2019 primarily due to a 180% increase in the volume of watts sold and a 4% increase in the average selling price per watt.Net sales from our systems segment decreased by $139.0 million in 2019 primarily as a result of the sale of the Mashiko and certain India projects in 2018 and the completion of substantially all construction activities at the California Flats, Willow Springs, and various other projects in Florida in late 2018 and early 2019, partially offset by the sale of the Sun Streams, Sunshine Valley, and Beryl projects and ongoing construction activities at the Phoebe and GA Solar 4 projects in 2019.\n\n## Cost of sales\n\n## Modules Business\n\nOur modules business cost of sales includes the cost of raw materials and components for manufacturing solar modules, such as glass, transparent conductive coatings, CdTe and other thin film semiconductors, laminate materials, connector assemblies, edge seal materials, and frames.In addition, our cost of sales includes direct labor for the manufacturing of solar modules and manufacturing overhead, such as engineering, equipment maintenance, quality and production control, and information technology.Our cost of sales also includes depreciation of manufacturing plant and equipment, facility-related expenses, environmental health and safety costs, and costs associated with shipping, warranties, and solar module collection and recycling (excluding accretion).\n\n## Systems Business\n\nFor our systems business, project-related costs include development costs (legal, consulting, transmission upgrade, interconnection, permitting, and other similar costs), EPC costs (consisting primarily of solar modules, inverters, electrical and mounting hardware, project management and engineering, and construction labor), and site specific costs.\n\nThe following table shows cost of sales by reportable segment for the years ended December 31, 2019, 2018, and 2017:\n\n|                                               | Years Ended   | Years Ended   | Years Ended   | Change         | Change         | Change         | Change         | |-----------------------------------------------|---------------|---------------|---------------|----------------|----------------|----------------|----------------| | (Dollars in thousands)                        | 2019          | 2018          | 2017          | 2019 over 2018 | 2019 over 2018 | 2018 over 2017 | 2018 over 2017 | | Modules . . . . . . . . . . . . . . . . . . .| $ 1,170,037   | $ 552,468     | $ 694,060     | $ 617,569      | 112%           | $ (141,592)    | (20)%          | | Systems . . . . . . . . . . . . . . . . . . .| 1,343,868     | 1,299,399     | 1,698,317     | 44,469         | 3%             | (398,918)      | (23)%          | | Cost of sales. . . . . . . . . . . . . . . .| $ 2,513,905   | $ 1,851,867   | $ 2,392,377   | $ 662,038      | 36%            | $ (540,510)    | (23)%          | | % of net sales . . . . . . . . . . . . . . .| 82.1%         | 82.5%         | 81.3%         |                |                |                |                |"],"2":["## HC2 HOLDINGS, INC.\n\n## NOTES TO CONSOLIDATED FINANCIAL STATEMENTS - CONTINUED\n\n## Indefinite\n\nlived Intangible Assets\n\nThe carrying amount of indefinite-lived intangible assets were as follows (in millions):\n\n|                | December 31,   | December 31,   | |----------------|----------------|----------------| |                | 2019           | 2018           | | FCC licenses   | $ 136.2        | $ 120.6        | | State licenses | 2.5            | 2.5            | | Total          | $ 138.7        | $ 123.1        |\n\nThe Broadcasting segment strategically acquires assets across the United States, which results in the recording of FCC licenses.Providing the Company acts within the requirements and constraints of the regulatory authorities, the renewal and extension of these licenses is reasonably certain at minimal costs.Accordingly, we have concluded that the acquired FCC licenses are indefinite-lived intangible assets.\n\nIn 2019, FCC licenses increased $15.6 million, $18.2 million of which was through acquisitions, offset by $2.3 million of impairments and $0.3 million loss on the sale of licenses.Our Broadcasting segment recorded the impairment as a result of its decision to forfeit FCC licenses in certain lower-ranked markets, and does not expect any significant changes to future cash flows as a result of these forfeitures.The Company reports intangible impairment charges within the Asset impairment expense line of our Consolidated Statements of Operations.\n\n## Definite Lived Intangible Assets\n\nThe gross carrying amount and accumulated amortization of amortizable intangible assets by major intangible asset class were as follows (in millions):\n\n|                              | Weighted-                    | December 31, 2019     | December 31, 2019        | December 31, 2019   | December 31, 2018     | December 31, 2018        | December 31, 2018   | |------------------------------|------------------------------|-----------------------|--------------------------|---------------------|-----------------------|--------------------------|---------------------| |                              | Average Original Useful Life | Gross Carrying Amount | Accumulated Amortization | Net                 | Gross Carrying Amount| Accumulated Amortization | Net                 | | Trade names                  | 13 Years                     | $ 26.0                | $ (7.9)                  | $ 18.1              | $ 25.9                | $ (5.9)                  | $ 20.0              | | Customer relationships       | 10 Years                     | 56.0                  | (15.7)\n\n| 40.3                | 53.6                  | (7.2)                    | 46.4                | | Channel sharing arrangements | 40 Years                     | 27.2                  | (0.9)                    | 26.3                | 25.2                  | -                        | 25.2                | | Developed technology         | 4 Years                      | 1.2                   | (1.2)                    | -                   | 1.2                   | (1.2)                    | -                   | | Other                        | 7 Years                      | 5.5                   | (1.9)                    | 3.6                 | 5.5                   | (1.0)                    | 4.5                 | | Total                        |                              | $ 115.9               | $ (27.6)                 | $ 88.3              | $ 111.4               | $ (15.3)                 | $ 96.1              |\n\nAmortization expense for definite lived intangible assets was $12.3 million and $4.9 million for the years ended December 31, 2019 and 2018, respectively, and was included in Depreciation and amortization in our Consolidated Statements of Operations.\n\n## VOBA\n\nVOBA is amortized in relation to the projected future premium of the acquired long-term care blocks of business and recorded amortization increases net income for the respective period.Negative amortization of VOBA was $23.5 million and $12.8 million for the years ended December 31, 2019 and 2018, respectively,\n\n## Amortization\n\nExcluding the impact of any future acquisitions, dispositions or change in foreign currency, the Company estimates the annual amortization expense of amortizable intangible assets for the next five fiscal years will be as follows (in millions):\n\n|            | Estimated Amortization           | Estimated Amortization   | |------------|----------------------------------|--------------------------| |            | Definite Lived Intangible Assets | Negative VOBA            | | 2020       | $ 8.6                            | $ (20.8)                 | | 2021       | 8.3                              | (19.6)                   | | 2022       | 8.2                              | (18.4)                   | | 2023       | 8.0                              | (17.1)                   | | 2024       | 7.5                              | (15.9)                   | |Thereafter | 47.7                             | (129.2)                  | | Total      | $ 88.3                           | $ (221.0)                |","## ADJUSTED EBITDA\n\nFiscal 2019 adjusted EBITDA increased by 26.1% (21.5% in constant currency).In local currency, adjusted EBITDA amounted to US$351.3 million compared to US$288.4 million for fiscal 2018.The increase was mainly due to the impact of the MetroCast and FiberLight acquisitions combined with strong organic growth.\n\nExcluding the MetroCast and FiberLight acquisitions and the prior year's non-recurring costs of $3.1 million ($US2.5 million) related to hurricane Irma, adjusted EBITDA in constant currency increased by 5.7% for fiscal 2019.\n\n## CAPITAL INTENSITY AND ACQUISITIONS OF PROPERTY, PLANT AND EQUIPMENT\n\nFiscal 2019 acquisitions of property, plant and equipment decreased by 9.4% (12.4% in constant currency) mainly due to:\n\nthe acquisition of several dark fibres throughout south Florida from FiberLight, LLC for a consideration of $21.2 million (US$16.8 million) during the second quarter of fiscal 2018; partly offset by\n\nadditional capital expenditures related to the impact of the MetroCast acquisition; and\n\nadditional capital expenditures related to the expansion in Florida.\n\nFiscal 2019 capital intensity reached 18.6% compared to 25.1% for fiscal 2018 mainly as a result of lower capital expenditures combined with revenue growth.\n\n## CUSTOMER STATISTICS\n\n<!-\n\nimage -\n\n>\n\n<!-\n\nimage -\n\n>\n\n|                             |                 | Net additions (losses) Years ended   | Net additions (losses)Years ended   | % of penetration (2)(3)             | % of penetration (2)(3)   | |-----------------------------|-----------------|--------------------------------------|--------------------------------------|-------------------------------------|---------------------------| |                             | August 31, 2019 | August 31,   2019                    | August 31,   2018                    | August 31,   2019 August 31,   2018 | (3)                       | | Primary service units       | 901,446         | 16,981                               | 20,251                               |                                     |                           | | Internet service customers  | 446,137         | 21,189                               | 21,417                               | 50.8                                | 49.7                      | | Video service customers     | 312,555         | (4,697)                              | (6,760)                              | 35.6                                | 37.1                      | | Telephony service customers | 142,754         | 489                                  | 5,594                                | 16.2                                | 16.6                      |\n\n(2) As a percentage of homes passed.\n\n(3) In the first quarter of fiscal 2019, the number of homes passed in the American broadband services segment have been adjusted upwards in order to reflect the number of non\n\nserved multi\n\ndwelling unit passings within the footprint and consequently, the penetration as a percentage of homes passed for fiscal 2018 have also been adjusted.\n\n## INTERNET\n\nFiscal 2019 Internet service customers net additions stood at 21,189 compared to 21,417 for the prior year as a result of:\n\nadditional connects related to the Florida expansion initiatives and in the MetroCast footprint;\n\nour customers' ongoing interest in high speed offerings; and\n\ngrowth in both the residential and business sectors.\n\n## VIDEO\n\nFiscal 2019 video service customers net losses stood at 4,697 compared to 6,760 for the prior year mainly from:\n\ncompetitive offers in the industry; and\n\na changing video consumption environment; partly offset by\n\nour customers' ongoing interest in TiVo's digital advanced video services; and\n\nthe activation of bulk properties in Florida during the fourth quarter of fiscal 2019.\n\n## TELEPHONY\n\nFiscal 2019 telephony service customers net additions stood at 489 compared to 5,594 for the prior year mainly as a result of the growth in the business sector, partly offset by a decline in the residential sector.\n\n## DISTRIBUTION OF CUSTOMERS\n\nAt August 31, 2019, 52% of the American broadband services segment's customers enjoyed \"double play\" or \"triple play\" bundled services.\n\nMD&A\n\n35"]},"response":{"0":"The factors considered when constructing the long-term rate of return assumption for defined benefit pension plans include asset class allocations, long-term rates of return (actual and expected), and results of periodic asset liability modeling studies.","1":"The total net sales for fiscal 2019 were $9.54 billion.","2":"The increase in FCC licenses in 2019 was $15.6 million."},"reference":{"0":"Factors such as asset class allocations, long-term rates of return (actual and expected), and results of periodic asset liability modeling studies are considered when constructing the long-term rate of return assumption for our defined benefit pension plans.","1":"$788,948","2":"$15.6 million"},"context_recall":{"0":1.0,"1":1.0,"2":1.0},"llm_context_precision_with_reference":{"0":1.0,"1":1.0,"2":0.9999999999},"context_precision":{"0":1.0,"1":1.0,"2":0.9999999999},"faithfulness":{"0":1.0,"1":1.0,"2":1.0},"answer_relevancy":{"0":0.9930746499,"1":0.9323103127,"2":0.981843644}}