{"user_input":{"0":"Why did the valuation allowance increase in fiscal 2019?","1":"What is the total net sales in 2019?","2":"How is the net average shell egg selling price calculated?"},"retrieved_contexts":{"0":["|                               | Years Ended October 31,   | Years Ended October 31,   | Years Ended October 31,   | |-------------------------------|---------------------------|---------------------------|---------------------------| |                               | 2019                      | 2018                      | 2017                      | |                               | (In thousands)            | (In thousands)            | (In thousands)            | |Current expense (benefit):    |                           |                           |                           | | Federal                       | $ (735)                   | $ (600)                   | $ 117,611                 | | State                         | (51)                      | (1,169)                   | 11,024                    |\n\n|                               | (786)                     | (1,769)                   | 128,635                   | |Deferred expense (benefit):   |                           |                           |                           | | Federal                       | 13,966                    | (28,845)                  | 15,452                    | | State                         | 2,753                     | 2,146                     | 1,804                     | | Change in valuation allowance | (5,380)                   | (2,406)                   | (1,106)                   | |                               | 11,339                    | (29,105)                  | 16,150                    | | Income tax expense (benefit)  | $ 10,553                  | $ (30,874)                | $ 144,785                 |\n\nSignificant components of the Company's deferred tax assets and liabilities are outlined below.\n\n|                                          | October 31,    | October 31,    | |------------------------------------------|----------------|----------------| |                                          | 2019           | 2018           | |                                          | (In thousands)| (In thousands)| | Deferred tax liabilities:                |                |                | | Property, plant and equipment            | $ 148,505      | $ 88,351       | | Prepaid and other assets                 | 1,911          | 1,751          | | Total deferred tax liabilities           | 150,416        | 90,102         | | Deferred tax assets:                     |                |                | | Accrued expenses and accounts receivable | 8,172          | 7,814          | | Inventory                                | 1,155          | 2,862          | | Compensation on restricted stock         | 7,528          | 8,280          | | State income tax credits                 | 9,333          | 12,235         | | Other                                    | 1,272          | 654            | | Valuation allowance                      | (5,637)        | (11,017)       | |Net operating loss                       | 54,461         | 6,481          | | Total deferred tax assets                | 76,284         | 27,309         | | Net deferred tax liabilities             | $ 74,132       | $ 62,793       |\n\nThe increase in the Company's deferred tax liability is primarily attributable to the Company's decision to take bonus depreciation on qualifying assets placed in service during fiscal 2019.\n\nIncluded in the deferred tax assets at October 31, 2019, is a federal NOL carryforward of $255.4 million.All of the NOL carryforward was incurred subsequent to the enactment of the TCJA and therefore has an indefinite carryforward period.The Company has significant deferred tax liabilities, primarily related to property, plant and equipment, which are expected to reverse and allow for the full utilization of the NOL carryforward.As such, the Company has not recorded a valuation allowance related to the NOL carryforward.Also included in the deferred tax assets are North Carolina Investing in Business Property Credit and North Carolina Jobs Credits totaling $4.9 million, as well as Georgia Job Tax Credits totaling $2.6 million.The North Carolina Investing in Business Property Credit provides a 7% investment tax credit for property located in a North Carolina development area, the North Carolina Creating Jobs Credit provides a tax credit for increased employment in North Carolina, and the Georgia Job Tax Credit provides a tax credit for creation and retention of qualifying jobs in Georgia.It is management's opinion that the majority of the North Carolina and Georgia income tax credits will not be utilized before they expire, and a $5.6 million valuation allowance has been recorded as of October 31, 2019.The North Carolina credits began to expire during fiscal 2018, and the remaining credits expire between fiscal years 2020 and 2023.","At the end of each reporting period, the Company evaluates all available information at that time to determine if it is more likely than not that some or all of these credits will be utilized.As of October 31, 2019, 2018, and 2017, the Company determined that a total of $1.8 million, $0.7 million, and $0.6 million, respectively, would be recovered.Accordingly, those amounts were released from the valuation allowance and benefited deferred tax expense in the respective periods.\n\nThe differences between the consolidated effective income tax rate and the federal statutory rate effective during the applicable year presented are as follows:\n\n|                                        | Years Ended October 31,   | Years Ended October 31,   | Years Ended October 31,   | |----------------------------------------|---------------------------|---------------------------|---------------------------| |                                        | 2019                      | 2018                      | 2017                      | |                                        | (In thousands)            | (In thousands)            | (In thousands)            | | Income taxes at statutory rate         | $ 13,408                  | $ 7,132                   | $ 148,585                 | | Discrete benefit resulting from TCJA   | -                         | (37,505)                  | -                         | | State income taxes                     | 1,189                     | 1,014                     | 9,038                     | | State income tax credits               | (2,139)                   | (804)                     | (606)                     |\n\n| Expiration of state income tax credits | 4,121                     | 4,117                     | 642                       | | Federal income tax credits             | (474)                     | (460)                     | (390)                     | | Federal manufacturers deduction        | -                         | -                         | (11,527)                  | | Excess tax benefits                    | (1,388)                   | (1,638)                   | (3,345)                   | | Nondeductible expenses                 | 1,786                     | 1,890                     | 3,506                     | | Change in valuation allowance          | (5,380)                   | (5,297)                   | (1,106)                   | | Other                                  | (570)                     | 677                       | (12)                      | | Income tax expense (benefit)           | $ 10,553                  | $ (30,874)                | $ 144,785                 |\n\n## 8.Earnings Per Share\n\nCertain share-based payment awards entitling holders to receive non-forfeitable dividends before vesting are considered participating securities and thus included in the calculation of basic earnings per share, to the extent they are dilutive.These awards are included in the calculation of basic earnings per share under the two-class method.The two-class method allocates earnings for the period between common shareholders and other security holders.The participating awards receiving dividends are allocated the same amount of income as if they were outstanding shares.\n\nThe following table presents earnings per share (in thousands).\n\n|                                                                          | For the years ended   |For the years ended   |For the years ended   | |--------------------------------------------------------------------------|-----------------------|-----------------------|-----------------------| |                                                                          | October 31, 2019      | October 31, 2018      | October 31, 2017      | |Net income                                                               | $ 53,294              | $ 61,431              | $ 279,745             | |Distributed and undistributed (earnings) to unvested restricted          | (778)                 | (878)                 | (4,285)               | | kDistributed and undistributed earnings to common shareholders -  Basic | 52,516                | 60,553                | 275,460               | |Weighted average shares outstanding - Basic                              | 21,829                | 22,429                | 22,393                | |Weighted average shares outstanding - Diluted                            | 21,829                | 22,429                | 22,393                | | Earnings per common share - Basic                                        | $ 2.41                | $ 2.70                | $ 12.30               | | Earnings per common share - Diluted                                      | $ 2.41                | $ 2.70                | $ 12.30               |"],"1":["## Fiscal 2019 compared to Fiscal 2018\n\n## Net Sales\n\n| ($ in millions)Reporting Segment                                                                                       | Fiscal 2019 Net Sales   | Fiscal 2018 Net Sales   | % Inc (Dec)   | |-------------------------------------------------------------------------------------------------------------------------|-------------------------|-------------------------|---------------| | Grocery & Snacks. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| $ 3,279.2               | $ 3,287.0               | - %           | | Refrigerated & Frozen . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 2,804.0                 | 2,753.0                 | 2 %           | | International . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 793.4                   | 843.5                   | (6)%          | | Foodservice. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 934.2                   | 1,054.8                 | (11)%         | | Pinnacle Foods . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .| 1,727.6                 | -                       | 100 %         | | Total . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . ..\n\n| $ 9,538.4               | $ 7,938.3               | 20 %          |\n\nOverall, our net sales were $9.54 billion in fiscal 2019, an increase of 20% compared to fiscal 2018.\n\nGrocery & Snacks net sales for fiscal 2019 were $3.28 billion, a decrease of $7.8 million compared to fiscal 2018.Volume, excluding the impact of acquisitions and divestitures, was flat in fiscal 2019 compared to the prior-year period.This result reflected merchandising changes and price elasticity-related declines in certain brands, as well as isolated production challenges, partially offset by the continued benefit from momentum and innovation successes in the snacks businesses.Price\/ mix was flat compared to the prior year as unfavorable mix, coupled with increases in brand building investments with retailers were offset by the impact of higher pricing.The acquisition of Angie's Artisan Treats, LLC, which was completed in October 2017, contributed $41.3 million to Grocery & Snacks net sales during fiscal 2019, through the one-year anniversary of the acquisition.Fiscal 2019 results included $115.9 million of net sales related to our Wesson $^{®}$ oil business, which was sold in the fourth quarter of fiscal 2019.Fiscal 2018 results included $156.4 million of net sales related to this divested business.\n\nRefrigerated & Frozen net sales for fiscal 2019 were $2.80 billion, an increase of $51.0 million, or 2%, compared to fiscal 2018.Results for fiscal 2019 reflected a 1% increase in volume compared to fiscal 2018, excluding the impact of acquisitions.The increase in sales volumes was a result of innovation across multiple brands, which was partially offset by the effects of reduced merchandising spend and the impact of a recall during the fourth quarter.Price\/mix was flat compared to fiscal 2018, as continued delivery of top-line accretive innovation in several brands was partially offset by brand building investments with retailers.The acquisition of the Sandwich Bros. of Wisconsin ® business, which was completed in February 2018, contributed $25.7 million to Refrigerated & Frozen's net sales during fiscal 2019, through the one-year anniversary of the acquisition.\n\nInternational net sales for fiscal 2019 were $793.4 million, a decrease of $50.1 million, or 6%, compared to fiscal 2018.Results for fiscal 2019 reflected a 2% increase in volume, excluding the impact of acquisitions and divestitures, a 4% decrease due to foreign exchange rates, and a 2% increase in price\/mix, in each case compared to fiscal 2018.The volume and price\/ mix increases for fiscal 2019 were driven by growth in the Canadian snacks and frozen businesses.The acquisition of Angie's Artisan Treats, LLC contributed $3.7 million to International net sales for fiscal 2019, through the one-year anniversary of the acquisition.Fiscal 2019 included $4.1 million of net sales related to our Del Monte $^{®}$ processed fruit and vegetable business in Canada, which was sold in the first quarter of fiscal 2019.Fiscal 2018 results included $48.9 million of net sales related to this divested business.In addition, fiscal 2019 and 2018 results included $17.1 million and $24.5 million, respectively, related to our divested Wesson $^{®}$ oil business.\n\nFoodservice net sales for fiscal 2019 were $934.2 million, a decrease of $120.6 million, or 11%, compared to fiscal 2018.Results for fiscal 2019 reflected a 14% decrease in volume, excluding divestitures.The decline in volume reflected the continued execution of the segment's value-over-volume strategy and the sale of our Trenton, Missouri production facility in the first quarter of fiscal 2019.Price\/mix increased 5% in fiscal 2019 compared to fiscal 2018.The increase in price\/mix for fiscal 2019 reflected favorable product and customer mix, the impact of inflation-driven increases in pricing, and the execution of the segment's value-over-volume strategy.Fiscal 2019 included $34.2 million of net sales related to our Wesson $^{®}$ oil business, which was sold in the fourth quarter of fiscal 2019.Fiscal 2018 results included $53.4 million of net sales related to this divested business.Net sales declined by approximately 7% in fiscal 2019 due to the sale of our Trenton, Missouri production facility.\n\nPinnacle Foods net sales for fiscal 2019 (reflecting 213 days of Conagra Brands ownership) were $1.73 billion.Results reflected expected consumption declines as the Company executes its value-over-volume strategy within the Pinnacle portfolio.","## Systems Business\n\nDuring 2019, EDP Renewables, ConnectGen, and Innergex Renewable Energy each accounted for more than 10% of our systems business net sales, and the majority of our systems business net sales were in the United States and Australia.Substantially all of our systems business net sales during 2019 were denominated in U.S. dollars and Australian dollars.We typically recognize revenue for sales of solar power systems using cost based input methods, which result in revenue being recognized as work is performed based on the relationship between actual costs incurred compared to the total estimated costs for a given contract.We may also recognize revenue for the sale of a development project, which excludes EPC services, or for the sale of a completed system when we enter into the associated sales contract with the customer.The revenue recognition policies for our systems business are further described in Note 2.\"Summary of Significant Accounting Policies\" to our consolidated financial statements.\n\nThe following table shows net sales by reportable segment for the years ended December 31, 2019, 2018, and 2017:\n\n|                                                | Years Ended   | Years Ended   | Years Ended   | Change         | Change         | Change         | Change         | |------------------------------------------------|---------------|---------------|---------------|----------------|----------------|----------------|----------------|| (Dollars in thousands)                         | 2019          | 2018          | 2017          | 2019 over 2018 | 2019 over 2018 | 2018 over 2017 | 2018 over 2017 | | Modules . . . . . . . . . . . . . . . . . . .| $ 1,460,116   | $ 502,001     | $ 806,398     | $ 958,115      | 191 %          | $ (304,397)    | (38)%          | | Systems . . . . . . . . . . . . . . . . . . .| 1,603,001     | 1,742,043     | 2,134,926     | (139,042)      | (8)%           | (392,883)      | (18)%          | |Net sales. . . . . . . . . . . . . . . . . . .| $ 3,063,117   | $ 2,244,044   | $ 2,941,324   | $ 819,073      | 36 %           | $ (697,280)    | (24)%          |\n\nNet sales from our modules segment increased by $958.1 million in 2019 primarily due to a 180% increase in the volume of watts sold and a 4% increase in the average selling price per watt.Net sales from our systems segment decreased by $139.0 million in 2019 primarily as a result of the sale of the Mashiko and certain India projects in 2018 and the completion of substantially all construction activities at the California Flats, Willow Springs, and various other projects in Florida in late 2018 and early 2019, partially offset by the sale of the Sun Streams, Sunshine Valley, and Beryl projects and ongoing construction activities at the Phoebe and GA Solar 4 projects in 2019.\n\n## Cost of sales\n\n## Modules Business\n\nOur modules business cost of sales includes the cost of raw materials and components for manufacturing solar modules, such as glass, transparent conductive coatings, CdTe and other thin film semiconductors, laminate materials, connector assemblies, edge seal materials, and frames.In addition, our cost of sales includes direct labor for the manufacturing of solar modules and manufacturing overhead, such as engineering, equipment maintenance, quality and production control, and information technology.Our cost of sales also includes depreciation of manufacturing plant and equipment, facility-related expenses, environmental health and safety costs, and costs associated with shipping, warranties, and solar module collection and recycling (excluding accretion).\n\n## Systems Business\n\nFor our systems business, project-related costs include development costs (legal, consulting, transmission upgrade, interconnection, permitting, and other similar costs), EPC costs (consisting primarily of solar modules, inverters, electrical and mounting hardware, project management and engineering, and construction labor), and site specific costs.\n\nThe following table shows cost of sales by reportable segment for the years ended December 31, 2019, 2018, and 2017:\n\n|                                               | Years Ended   | Years Ended   | Years Ended   | Change         | Change         | Change         | Change         | |-----------------------------------------------|---------------|---------------|---------------|----------------|----------------|----------------|----------------| | (Dollars in thousands)                        | 2019          | 2018          | 2017          | 2019 over 2018 | 2019 over 2018 | 2018 over 2017 | 2018 over 2017 | | Modules . . . . . . . . . . . . . . . . . . .| $ 1,170,037   | $ 552,468     | $ 694,060     | $ 617,569      | 112%           | $ (141,592)    | (20)%          | | Systems . . . . . . . . . . . . . . . . . . .| 1,343,868     | 1,299,399     | 1,698,317     | 44,469         | 3%             | (398,918)      | (23)%          | | Cost of sales. . . . . . . . . . . . . . . .| $ 2,513,905   | $ 1,851,867   | $ 2,392,377   | $ 662,038      | 36%            | $ (540,510)    | (23)%          | | % of net sales . . . . . . . . . . . . . . .| 82.1%         | 82.5%         | 81.3%         |                |                |                |                |"],"2":["| 222,859        | 361,046        | 45,550         | |Net average shell egg selling price (rounded)                            | 1.27           | 1.40           | 1.01           | | Average Urner Barry Spot Egg Market Quotations  1                        | 1.23           | 1.49           | 0.85           | | Feed cost per dozen produced                                             | 0.415          | 0.394          | 0.399          |\n\nThe shell egg industry has historically been subject to periods of high profitability followed by periods of significant loss.The periods of high profitability have often reflected increased consumer demand relative to supply while the periods of significant loss have often reflected excess supply for the then prevailing consumer demand.Historically, demand for shell eggs increases in line with overall population growth.As reflected above, our operating results fluctuate with changes in the spot egg market quote and feed costs.The net average shell egg selling price is the blended price for all sizes and grades of shell eggs, including non-graded shell egg sales, breaking stock and undergrades.In fiscal 2017, our net average selling price and dozens sold decreased over the previous fiscal year primarily due to the oversupply of eggs resulting from the repopulation of the national flock of laying hens to levels exceeding the flock size prior to the avian influenza outbreak in 2015, along with a reduced demand for egg products.In fiscal 2018, strong demand resulted in an increase in our average selling price and dozens sold, and feed costs decreased over prior years.Fiscal 2019 saw an increasing U.S. flock size result in oversupply of eggs, particularly in the last half of the fiscal year.This resulted in decreased gross profit and net income for fiscal 2019.\n\n## Fiscal Year Ended June 1, 2019Compared to Fiscal Year Ended June 2, 2018\n\n## NET SALES\n\nNet sales for the fiscal year ended June 1, 2019 were $1,361.2 million, a decrease of $141.7 million, or 9.4%, from net sales of $1,502.9 million for fiscal 2018.The decrease was primarily due to lower selling prices for non-specialty eggs in fiscal 2019 due to the oversupply of eggs, particularly in the last half of the fiscal year, contrasted with fiscal 2018 in which we experienced strong demand resulting in higher prices for non-specialty eggs.\n\nIn fiscal 2019, shell egg sales made up approximately 97% of our net sales.Total dozens sold in fiscal 2019 were 1,038.9 million, an increase of 1.2 million dozen, or 0.1%, compared to 1,037.7 million sold in fiscal 2018 resulting in an increase in net sales of $1.7 million for fiscal 2019 compared with the prior year.\n\nNet average selling price of shell eggs decreased from $1.397 per dozen for fiscal 2018 to $1.265 per dozen for fiscal 2019, a decrease of $0.132 per dozen, or 9.4%, primarily reflecting an abundance of eggs in the market.The decrease in sales price in fiscal 2019 from fiscal 2018 resulted in a corresponding decrease in net sales of approximately $137.1 million.Our operating results are significantly affected by wholesale shell egg market prices, which are outside of our control.Small changes in production or demand levels can have a large effect on shell egg prices.\n\nEgg products accounted for approximately 3% of our net sales.These revenues were $41.5 million for the fiscal year ended June 1, 2019 compared with $43.5 million for the fiscal 2018.\n\nThe table below represents an analysis of our non-specialty and specialty, as well as co-pack specialty, shell egg sales.Following the table is a discussion of the information presented in the table.\n\nTable of Contents\n\n|                                      | Fiscal Years Ended                   | Fiscal Years Ended                   | Fiscal Years Ended                   | Fiscal Years Ended                   | Quarters Ended                       | Quarters Ended                       | Quarters Ended                       | Quarters Ended                       | |--------------------------------------|--------------------------------------|--------------------------------------|--------------------------------------|--------------------------------------|--------------------------------------|--------------------------------------|--------------------------------------|--------------------------------------| |                                      | June 1, 2019                         | June 1, 2019                         | June 2, 2018                         | June 2, 2018                         | June 1, 2019                         | June 1, 2019                         | June 2, 2018                         | June 2, 2018                         | |                                      | (Amounts in thousands)               | (Amounts in thousands)               | (Amounts in thousands)               | (Amounts in thousands)               | (Amounts in thousands)               | (Amounts in thousands)               | (Amounts in thousands)               | (Amounts in thousands)               | |Net sales                            | $ 1,361,188                          |\n\n| $ 1,502,932                          |                                      | $ 280,572                            |                                      | $ 443,095                            |                                      | | Shell egg sales:                     |                                      |                                      |                                      |                                      |                                      |                                      |                                      |                                      | | Non-specialty                        | 810,306                              | 61.4%                                | 956,909                              | 65.6%                                | 150,860                              | 55.5%                                | 294,892                              | 68.8%                                | | Specialty                            | 478,057                              | 36.2%                                | 467,469                              | 32.0%                                | 113,835                              | 41.9%                                | 124,400                              | 29.0%                                | | Co-pack specialty                    | 26,112                               | 2.0%                                 | 26,092                               | 1.8%                                 | 6,057\n\n| 2.2%                                 | 7,216                                | 1.7%                                 | | Other                                | 5,205                                | 0.4%                                 | 8,943                                | 0.6%                                 | 968                                  | 0.4%                                 | 2,152                                | 0.5%                                 | |Net shell egg sales                  | $ 1,319,680                          | 100.0%                               | $ 1,459,413                          | 100.0%                               | $ 271,720                            | 100.0%                               | $ 428,660                            | 100.0%                               | |As a percent of net  sales           |                                      | 97%                                  |                                      | 97%                                  |                                      | 97%                                  |                                      | 97%                                  | | Dozens sold:                         |                                      |                                      |                                      |                                      |                                      |                                      |                                      |\n\n|| Non-specialty                        | 778,052                              | 74.9%                                | 780,362                              | 75.2%                                | 192,310                              | 75.5%                                | 184,301                              | 73.1%                                | | Specialty                            | 247,614                              | 23.8%                                | 244,022                              | 23.5%                                | 59,390                               | 23.3%                                | 64,081                               | 25.5%                                | | Co-pack specialty                    | 13,234                               | 1.3%                                 | 13,329                               | 1.3%                                 | 3,072                                | 1.2%                                 | 3,573                                | 1.4%                                 | |Total dozens sold                    | 1,038,900                            | 100.0%                               | 1,037,713                            | 100.0%                               | 254,772                              | 100.0%                               | 251,955                              | 100.0%                               | | Net average selling price per dozen: | Net average selling price per dozen: | Net\n\naverage selling price per dozen: | Net average selling price per dozen: | Net average selling price per dozen: | Net average selling price per dozen: | Net average selling price per dozen: | Net average selling price per dozen: | Net average selling price per dozen: | | All shell eggs                       | $ 1.265                              |                                      | $ 1.397                              |                                      | $ 1.062                              |                                      | $ 1.694                              |                                      | | Non-specialty                        | $ 1.041                              |                                      | $ 1.226                              |                                      | $ 0.784                              |                                      | $ 1.600                              |                                      | | Specialty                            | $ 1.931                              |                                      | $ 1.916                              |                                      | $ 1.917                              |                                      | $ 1.941                              |                                      |","## 2.Disaggregation of Revenue\n\nThe following table disaggregates our net sales by product category (in millions):\n\n| Product Category             | Fiscal Year 2019   | Fiscal Year 2018   | Fiscal Year 2017   | |------------------------------|--------------------|--------------------|--------------------| | Fresh, vacuum-sealed chicken | $ 1,310.2          | $ 1,139.3          | $ 1,339.1          | |Fresh, chill-packed chicken  | 1,137.7            | 1,158.3            | 1,044.7            | |Fresh, ice-packed chicken    | 511.5              | 503.6              | 547.1              | | Prepared chicken             | 240.8              | 207.6              | 170.8              | | Frozen chicken               | 213.0              | 211.5              | 223.9              | |Other                        | 27.1               | 15.7               | 16.6               | |Total net sales              | $ 3,440.3          | $ 3,236.0          | $ 3,342.2          |\n\n## 3.Inventories\n\nInventories consisted of the following:\n\n|                                                     | October 31,    | October 31,    | |-----------------------------------------------------|----------------|----------------| |                                                     | 2019           | 2018           | |                                                     | (In thousands)| (In thousands)| | Live poultry-broilers (net of reserve) and breeders | $ 179,870      | $ 150,980      | | Feed, eggs and other                                | 47,417         | 37,965         | |Processed poultry                                   | 35,121         | 30,973         | | Prepared chicken                                    | 20,032         | 13,591         | | Packaging materials                                 | 7,488          | 6,547          | | Total inventories                                   | $ 289,928      | $ 240,056      |\n\nThe increase in live inventories is attributable to an increase in the quantity of live birds in inventory at the Company's Tyler, Texas facility as it increased production during fiscal 2019, as well as the value at which the Company's live poultry inventories of broilers are recorded.In periods where the Company estimates that the cost to grow live birds in inventory to a marketable age and then process and distribute those birds will be lower in the aggregate than the anticipated sales proceeds, the Company values the broiler inventories on hand at cost and accumulates costs as the birds are grown to a marketable age subsequent to the balance sheet date.In periods where the Company estimates that the cost to grow live birds in inventory to a marketable age and then process and distribute those birds will be higher in the aggregate than the anticipated sales proceeds, the Company will make an adjustment to lower the value of live birds in inventory to the net realizable value.The significant judgments that management makes in order to assess the net realizable value of its broiler inventory include estimating future selling prices of finished products and the related cost of sales to complete.The Company recorded a charge of $2.8 million at October 31, 2019 and of $9.6 million at October 31, 2018 to reduce the values of live broiler inventories on hand at those dates from cost to net realizable value.\n\nThe increases in feed, eggs and other, processed poultry and packaging materials inventories are also attributable to an increase in the inventory volume at the Tyler, Texas facility.\n\nThe increase in prepared chicken inventory is attributable to the mix of the different finished products in inventory at October 31, 2019, as compared to October 31, 2018, as well as an increase in production volume at the Company's prepared chicken facility in Flowood, Mississippi.During fiscal 2019, the facility processed approximately 129.1 million pounds of prepared chicken products, as compared to approximately 107.6 million pounds during fiscal 2018.Approximately 1.2 million pounds of that increase was in inventory at October 31, 2019, representing an approximately 12% increase in inventory volume."]},"response":{"0":"The valuation allowance increased in fiscal 2019 primarily due to management's assessment that a portion of the North Carolina and Georgia income tax credits would not be utilized before they expire. As a result, a $5.6 million valuation allowance was recorded as of October 31, 2019.","1":"The total net sales in fiscal 2019 were $9,538.4 million.","2":"The net average shell egg selling price is the blended price for all sizes and grades of shell eggs, including non-graded shell egg sales, breaking stock, and undergrades."},"reference":{"0":"mainly attributable to corresponding changes in deferred tax assets, primarily foreign tax credit carryforwards and certain state tax credit carryforwards.","1":"$1,791,790","2":"blended price for all sizes and grades of shell eggs, including non-graded shell egg sales, breaking stock and undergrades."},"context_recall":{"0":1.0,"1":1.0,"2":1.0},"llm_context_precision_with_reference":{"0":1.0,"1":1.0,"2":0.9999999999},"context_precision":{"0":1.0,"1":1.0,"2":0.9999999999},"faithfulness":{"0":0.6666666667,"1":1.0,"2":1.0},"answer_relevancy":{"0":1.0,"1":0.9687163983,"2":0.9597389995}}